[{"url": "https://e.vnexpress.net/news/travel/ha-long-bay-cruises-offer-rooms-at-discounted-rates-to-attract-guests-4711125.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-18&vn_term=Desktop", "title": "Ha Long Bay cruises offer rooms at discounted rates to attract guests", "content": "Cruise tickets in Ha Long Bay are being sold at prices 20-25% lower than usual to attract more visitors. ", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/thailand-s-airports-prepare-for-increasing-number-of-passengers-during-lunar-new-year-4709882.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-40&vn_term=Desktop", "title": "Thailand's airports prepare for increasing number of passengers during Lunar New Year", "content": "The Airports of Thailand (AOT) expects that foreign arrivals will increase sharply during the coming Lunar New Year holidays. Early this week, Thailand’s Prime Minister Srettha Thavisin made a surprise visit to Suvarnabhumi airport and instructed officials to speed up immigration and baggage claim procedures for travelers. AOT Director Kirati Kijmanawat said on Feb. 6 that the number of passengers flying into Thailand is expected to jump by 206%, compared to the same period last year, as the country has now fully reopened to foreign visitors. He said the government's visa-free policy for tourists from countries has given the industry a much-needed boost. Thailand is applying visa exemption for visitors from Kazakhstan and China for 30-day stay until Feb. 29. Russian passport holders can stay in Thailand for 90 days until April 30, while Indian and Taiwanese tourists also enjoy a 30-day stay until May 10. Recently, Thailand and China signed an agreement on a reciprocal visa-free scheme that will take effect from March 1. Under the agreement, holders of valid, ordinary Thai passports and Chinese holders of passports for public affairs and ordinary passports will be exempt from visa requirements for entering, exiting or transiting the other country for up to 30 days. Kirati also said that self-check-in kiosks had been installed at AOT's six international airports – Suvarnabhumi, Don Mueang, Phuket, Chiang Mai, Hat Yai and Chiang Rai – so that passengers can check in up to six hours in advance. The Suvarnabhumi airport has 210 self-check-in kiosks while 50 are available at Don Mueang, Kirati said, adding passengers can save time and avoid long queues as the service only takes a few minutes. According to the official, about 17% of passengers use the self-check-in system, and AOT plans to increase the number to 50%.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/canadian-charged-for-trying-to-open-thai-plane-door-on-runway-4710781.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-26&vn_term=Desktop", "title": "Canadian charged for trying to open Thai plane door on runway", "content": "Thai police said Friday they have charged a Canadian who tried to open the door of an aircraft as it was waiting to take off claiming someone was trying to kill him. The 40-year-old attempted to open the emergency exit on a Thai Airways flight to Bangkok from the northern town of Chiang Mai on Wednesday. The incident caused delays to more than a dozen flights, police said. \"He was charged with two counts -- causing harm to others in the aircraft and not following aircraft staff instructions,\" Nattawut Noisorn, deputy chief of investigation at Phu Ping Ratchaniwet police station, told AFP. \"He told us he opened the door because someone in the plane tried to kill him. He was very panicked.\" Police are investigating whether he had used any substances before boarding the plane or was suffering any mental illnesses. Watcharapon Pethsurp, who was on the flight, described the drama. \"I was sitting at the back of the aircraft and I heard a strong wind and shouting from the front part. It was chaotic,\" he told AFP. \"The man was shouting saying a man in a black outfit was trying to kill him.\" After the incident, Thai Airways released a statement saying the flight took off more than three hours later than the scheduled time.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/weekend-tastes-tet-market-and-endless-roasts-in-saigon-4706466.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-64&vn_term=Desktop", "title": "Weekend tastes: Tet market and endless roasts in Saigon", "content": "This weekend, Saigon invites you to experience an array of cultural and artistic experiences, from Tet market, Valentine's workshop, to Sunday roasts. Tet market Saigon Outcast, a social hub in Ho Chi Minh City, will host a Tet market titled \"More than a Tet\" with the aim of fostering a connection between eastern and western cultures. The festival will showcase colorful stalls, decorations, and an array of traditional food, crafts, and cultural performances. Attendees can explore handcrafted gifts, take photos at the booth, and sample banh chung (square rice cake) and receive lucky money. The event is scheduled to take place from noon to 8 p.m. on Feb. 3 at Saigon Outcast, situated at 188/1 Nguyen Van Huong Street, District 2. Sunday roast all-you-can-eat Every Sunday, the Renaissance Riverside Hotel Saigon invites diners to savor their \"Sunday Roast All You Can Eat\" experience. The menu features a wide range of roasted dishes, including pork belly, whole beef rib, chicken, legs of lamb, and seabass. These dishes are accompanied by an assortment of gravies, sauces, Yorkshire pudding, and other side dishes. The menu is available from noon to 2:30 p.m., priced at VND700,000 ($28) per guest, excluding beverages. The venue is Viet Kitchen on the G Floor of Renaissance Riverside Hotel Saigon, at 8-15 Ton Duc Thang Street, District 1. Book exchange The supermarket chain Annam Gourmet will host a two-day book sharing event where people can share, swap, and donate books. The event will feature selected books, publications from the local community, various artworks like paintings, a book exchange, and engaging activities in partnership with local artists. The event will occur at two locations over two days. Visitors have the opportunity to drop off books at Annam Gourmet Thao Dien, situated at 41 Thao Dien Street in District 2, on Feb. 2 from 10 a.m. to 5 p.m. The event will also take place at Annam Gourmet Riverpark Premier, located at 64-70 Nguyen Duc Canh Street in District 7, on Feb. 3, during the same hours of 10 a.m. to 5 p.m. Painting workshop \"A Night of Love\" The \"Valentine Paint and Sip Workshop: A Night of Love\" is an art event dedicated to the upcoming Valentine's Day celebration. The February event theme is inspired from Gustav Klimt's artwork, \"The Kiss.\" The workshop provides participants with all the necessary tools and materials, including a canvas, palette, acrylic paint, paintbrush, and an apron. Participants will be served a complimentary glass of wine. The workshop will be held from 7 p.m. to 10 p.m. on both Feb. 3 and 4. The location of the workshop is set at Studio Kloud Art, at SH.01, Aqua 1, Vinhomes Golden River in District 1. Ticket prices are set at VND500,000 ($20.50) with wine included or VND450,000 without wine. Flamenco night and Tet celebration Sofitel Saigon Plaza presents a weekend of rhythmic festivities, showcasing two events, \"Flamenco Night\" and a \"Lunar’s DJ Night\" at its cocktail bar, the Ministry of Men. On Feb. 2, attendees have the option to join \"Flamenco Magic\" from 9 p.m. to midnight, highlighted by a live DJ performance featuring a fusion of Flamenco and Latin beats. The events persist on Feb. 3 with \"Lunar’s DJ Night\", also running from 9 p.m. to midnight, presenting a celebration of Vietnamese Tet with beats. The two events are hosted at the Ministry of Men, on the 3rd floor of Sofitel Saigon Plaza, 17 Le Duan Street, District 1.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/how-to-make-jellied-pork-a-tet-staple-4706452.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-46&vn_term=Desktop", "title": "How to make jellied pork, a Tet staple", "content": "'Thit dong,' or jellied pork, featuring crunchy wood ear mushrooms and a jelly-like savory broth that melts in your mouth upon consumption, is a staple dish of Tet meals in northern Vietnam. Jellied pork is a popular dish enjoyed in colder months in northern Vietnam. Traditionally served cold, the origins of this dish are often associated with the idea of unintentionally leaving a stewed pork leg outside in the cold. This recipe serves about 6 to 8 people, takes approximately 70 minutes to prepare, and provides around 2,970 calories in total. Ingredients: - 1 kilogram of deboned pork leg meat - 300 grams of pork skin - 100 grams of wood ear mushrooms - Spices: salt, fish sauce, pepper, MSG (optional), shallots Instructions 1. Preparation - Choose deboned pork leg with a tender texture. Depending on your taste, you can include pork ears, tongue, and nose. - Remove any hair on the skin, then rub with salt and wash. The collagen in the pork skin turns the pork mixture into a jelly-like consistency as it cools. However, be careful not to add too much pork skin to avoid the jellied pork becoming too tough. - Submerge pork leg meat and skin in enough cold water to cover them. It's advised to avoid placing the meat and skin directly into boiling water initially to prevent impurities from being trapped in them. - Add a pinch of salt and crushed shallots to eliminate odors. - Bring the pot to a boil and let the meat and skin cook for about 5 minutes. - After boiling, remove and rinse the meat and skin until clean. - Cut them into bite-sized pieces. - Marinate the meat and skin with a teaspoon of salt, fish sauce. - Soak wood ear mushrooms in water, clean, and cut into long strips. - Marinate the mushrooms with a teaspoon of fish sauce and pepper. - Over time, variations have emerged, including the addition of carrots and shiitake mushrooms. Feel free to include these ingredients based on your preference. 2. Cooking process - In a hot pan, fry shallots in oil until fragrant. - Remove the shallots once cooked and stir-fry the meat in the same oil until it firms up. - Add hot water, bring to a boil, then simmer on low heat. - Optionally, you can skip stir-frying the meat to preserve its pure flavors. - Maintain a low simmer and leave the lid slightly open to let steam out, avoiding too much heat. High heat may break down collagen, leading to a cloudy broth. - Allow the meat and skin to simmer for 50 to 60 minutes. During this time, collagen in the skin gradually transforms into gelatin. This gelatin, when cooled, solidifies the broth, giving it a consistency similar to jelly. - Add wood ear mushrooms, cook over low heat for 6-8 minutes, season with fish sauce and optional MSG. - Remove the skin if not preferred. - After cooking, transfer the meat into individual serving bowls. Optionally, sprinkle the mixture with some pepper. - Cool the meat in the refrigerator to achieve a jelly-like consistency. In the past, people would wait for the temperature to drop and place the meat bowl outside to cool. - When serving, gently shake the bowl and place it face down on a plate to release the jellied pork. 3. Final product - The jellied pork bowl should be clear, with soft meat and a slowly dissolving jelly-like broth when eaten. - This dish is often served along with a bowl of chillies fish sauce and pickled scallion heads (cu kieu).", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/foreign-tourists-receive-lucky-money-make-vietnamese-tet-cakes-4710520.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-24&vn_term=Desktop", "title": "Foreign tourists receive lucky money, make Vietnamese Tet cakes", "content": "Vietnam tours are offering international visitors the opportunity to make their own Tet sticky rice cakes, receive lucky money and enjoy other holiday staples, according to travel agents and resorts. Around 80% of Phu Quoc's Tet guests are foreigners and the island’s tourism industry has launched various programs to promote the Vietnamese holiday. A representative from Salinda Phu Quoc resort said most of its customers during the one-week Tet break, from Feb. 8 to 14, are from China, South Korea, Kazakhstan, the U.K. and other European countries. The resort will organize a lion’s dance and a solemn ancestors’ worshiping ceremony at midnight on Lunar New Year’s Eve – 12 a.m. Saturday morning. It has been holding lucky envelop making workshops, as well as classes on making traditional Tet sticky rice cakes like banh chung and banh tet. Workshops on paper peach and ochna mai flower arrangement, Tet's most typical decorations, are also on offer. Each guest is also gifted a brochure about Tet programs that explains Vietnamese Lunar New Year traditions and the meaning of the zodiac animal this year, the dragon. Some tourists are especially interested in the making of banh chung and banh tet. Aran from the Netherlands said he has been to Phu Quoc five times, and has been to Vietnam twice during Tet. \"Every time it feels like returning to visit my family,\" Aran said. Aran and his friend Jeroen participated in the sticky rice making workshop, saying they felt lucky to visit Vietnam during the country's biggest holiday, which has given them the chance to learn about its traditions. \"We would like to wish all friends in Vietnam and our families in the Netherlands a Tet full of health, happiness and prosperity,\" the duo said. Pullman Phu Quoc, which is hosting mostly Korean tourists and those from Russian-speaking countries, has also allocated an outdoor space for a banh chung making workshop, while organizing traditional games associated with Tet as well. A Korean tourist said it was the first time his family has stayed in Phu Quoc for Tet. They attended the banh chung workshop together and made their first cake by their own hands. \"The hotel helped boil that cake and served it to me the next day. I really have had many interesting experiences and got to learn more about Vietnam’s traditions,\" the Korean man said. Several travel agents in Ho Chi Minh City have also designed special Tet programs for foreign tourists. Tran Thi Bao Thu, director of marketing and communications at Vietluxtour, said the company is receiving 50% more foreign tourists this Tet than last year, most of them from Australia, Poland and the Czech Republic. Thu said besides regular tours that take tourists around the city's downtown to learn about its history and culture, and company has introduced tours where foreign tourists get to try Vietnamese Tet meals and receive lucky money. Tran The Dung, general director of Vietluxtour, said the company has always received positive comments from foreign tourists about its Tet programs. \"They helped bring tourists beautiful impressions about Vietnamese culture,\" Dung said.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/thailand-to-offer-medical-coverage-for-tourists-4711842.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-2&vn_term=Desktop", "title": "Thailand to offer medical coverage for tourists", "content": "Thailand has launched a scheme to offer visitors up to US$14,000 in medical coverage in the event of an accident, the tourism minister said Thursday, as the kingdom seeks to lure travellers back after the pandemic. The government will cover expenses up to 500,000 baht ($14,000) and pay compensation of up to one million baht in case of death under the new scheme. Travel restrictions during the Covid-19 pandemic hammered the kingdom's vital tourism sector and arrivals have not bounced back as quickly as officials hoped. Tourism minister Sudawan Wangsuphakijkosol told AFP the new Thailand Traveller Safety scheme began on Jan. 1 and will run until Aug. 31. \"The campaign aims to assure foreign tourists that Thailand is safe and everyone will be under good care,\" she said. The kingdom has long been popular with young backpackers from around the world seeking sun, sand and adrenalin. But accidents are not uncommon and there have been numerous reports in recent months of young Europeans finding themselves facing big medical bills with inadequate insurance. The Thai government stresses that the scheme will not cover accidents caused by \"negligence, intent, illegal acts\" or risky behaviour. Tourists can register for the scheme through the Thailand Traveller Safety website at tts.go.th. Some 28 million people visited Thailand in 2023, up from 11 million the year before, but still well down from the 40 million who came in 2019, the last year before the pandemic. Officials are hoping to hit 35 million visitors in 2024, with a target of $55 billion in revenue.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/foreign-tourists-to-phu-quoc-increase-six-fold-over-tet-holiday-4711506.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-10&vn_term=Desktop", "title": "Foreign tourists to Phu Quoc increase six-fold over Tet holiday", "content": "The southern island of Phu Quoc was estimated to welcome 52,000 international visitors during the seven-day Tet break, recording an increase of nearly six times in number and eight times in revenue year-on-year. The influx of foreign tourists helped Phu Quoc’s tourism revenues reach over VND1.1 trillion (US$44.7 million), according to the Kien Giang Department of Tourism. On February 9, Lunar New Year’s Eve, PhuQuoc welcomed 2,000 tourists from Europe on the AIDAbella cruise ship. The tour group visited Phu Quoc National Park, took a cable car ride to Hon Thom Islet and explored traditional fish sauce production villages. This is also the second cruise ship to dock at the island in a week. On February 2, the cruise ship Costa Serena carrying 1,000 tourists mainly from Thailand also docked at Duong Dong Port. Vietnam's largest island last year suffered a tourism crisis with falling tourist numbers due to soaring airfares, expensive tourism services and various scams. Authorities recently pledged to improve the quality of tourism services and crack down on tourist scams.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/south-korea-s-aero-k-commences-cheongju-da-nang-service-4709190.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-48&vn_term=Desktop", "title": "South Korea's Aero K commences Cheongju-Da Nang service", "content": "South Korea's budget airline Aero K opened a new route connecting Cheongju City to the central city of Vietnam. According to the Korean carrier, Da Nang is the first city in Vietnam that Aero K has chosen to operate regular flights from Cheongju to Da Nang with a frequency of one flight every day. The first flight departed from Cheongju at 10:05 p.m. on Feb. 5 and landed in Da Nang at 00:45 a.m. the next day. The return trip departed from Da Nang at 2:15 a.m. on the same day. Deputy Director of the Da Nang Tourism Promotion Centre Mai Thi Thanh Hai said that Aero K’s flights from Cheongju - Da Nang and vice versa will offer opportunities and choices for travelers of the two countries in general and two localities in particularly, especially during the coming Lunar New Year 2024. Besides the launch ceremony, the city’s tourism department and the Korean airline are joining hands in holding a welcome ceremony for 170 passengers onboard the first Aero K flight from Cheongju to Da Nang. South Korea is the leading international market for Da Nang tourism. There are 23 - 25 flights from major Korean cities such as Seoul, Busan, Daegu, Muan, and Cheongju, or more than 50% of the total number of international flights to Da Nang a day. According to Da Nang International Airport, during the Lunar New Year 2024 lasting from Feb. 8 to 14, about 894 flights are expected to arrive in Da Nang, an increase of 16% over the same period last year. During the period, the city expects to welcome nearly 362,000 visitors, including 172,000 foreigners, up 23% from the same period last year.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/bali-10-tourist-e-tax-comes-into-force-4711552.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-8&vn_term=Desktop", "title": "Bali $10 tourist e-tax comes into force", "content": "The Indonesian resort haven of Bali began imposing a 150,000 rupiah ($10) tax on arriving tourists Wednesday to preserve the culture of the \"Island of Gods\", officials said. Tourist-dependent Bali attracts millions of foreign visitors annually and the beach-dotted island is trying to capitalize on its popularity to boost its coffers and protect its tropical allure. \"This levy is aimed at the protection of the culture and the environment in Bali,\" Bali's acting governor Sang Made Mahendra Jaya said at a launch ceremony Monday. The fee will have to be paid electronically through the \"Love Bali\" online portal and will apply to foreign tourists entering Bali from abroad or from other parts of Indonesia, according to a press release. The levy will not apply to domestic Indonesian tourists. Nearly 4.8 million tourists visited Bali between January and November last year, according to official figures, as the island continued to rebound from the Covid-19 pandemic after imposing a zero-tolerance policy on rule-breakers. The palm-fringed hotspot has vowed a crackdown on misbehaving tourists after a spate of incidents that have included acts of disrespect to the predominantly Hindu island's culture. Incidents in recent years have included foreign tourists posing for naked photographs at sacred sites and flashing in the street. Last year, the local government published an etiquette guide for tourists who wish to visit Bali after being pressed to do so by the island's immigration office.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/vietnamese-fermented-pork-among-worlds-best-dishes-with-hot-peppers-4710964.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-22&vn_term=Desktop", "title": "Vietnamese fermented pork among world’s best dishes with hot peppers", "content": "Cured fermented pork or nem chua, Vietnam's popular appetizer has been named by renowned culinary website Taste Atlas as one of the world’s best dishes with hot peppers. Taste Atlas published its list of 52 best, in which nem chua, the only Vietnamese entry, placed 50th. Nem chua is a traditional dish made from fermented meat. The most popular version is made from pork though it can also be made with beef. The dish also has other ingredients apart from chili pepper such as pork skin, spices and garlic. Taste Atlas wrote: \"The combination is wrapped into banana leaves, then stored for the fermentation process from 3 to 5 days in a cold place. \"These rolls have a sweet, salty, spicy, and sour flavor, and they're usually served as a snack or an appetizer with raw garlic on top, and fish sauce or chili sauce on the side,\" The website added that nem chua is especially popular during Lunar New Year. Other Asian dishes on the list included Chongqing chicken of China, Ikan bakar grilled fish of Indonesia and Thailand’s nam phrik chili sauce and Gaeng kiew wan green curry paste. The list is based on a vote by experts and readers with the criteria being popularity, local specialty, flavor, and love from people. Taste Altas was founded in 2015 and has since connected with over 9,000 local restaurants, introducing more than 10,000 dishes to readers with thousands of reviews and research from culinary experts and chefs. The website seeks to become a world map of traditional dishes made from local ingredients.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/vietnamese-sour-soup-caramelized-clay-pot-among-asias-finest-fish-dishes-4706474.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-3&vn_term=Desktop", "title": "Vietnamese sour soup, caramelized clay pot among Asia's finest fish dishes", "content": "Sweet and sour soup has ranked 11th and caramelized fish in a clay pot ranked 44th in a list of the 53 best Asian fish dishes as voted by cuisine magazine TasteAtlas. The rankings are based on the number of votes from diners and culinary experts, with a total of 2,492 ratings. Canh chua ca - sweet and sour soup - refers to a range of Vietnamese fish soups known for their blend of sweet, spicy, and sour tastes. These soups are typically made with a tamarind-infused broth and feature chunks of pineapple, tomatoes, okra, bean sprouts, or assorted veggies. While catfish is a common choice, other variations may include carp, snakehead fish, eels, or salmon. Typically garnished with cilantro, these soups are served alongside rice. Canh chua ca has also earned recognition as one of the top 35 highest-rated fish soups by TasteAtlas, securing 5th position. Meanwhile, ca kho to - caramelized fish in clay pot - involves braising fatty fish cuts in clay pots (to). Typically featuring catfish or snakehead, the dish is caramelized with a mixture of fish sauce, sugar, and coconut water, often enhanced with sliced scallions, onions, or garlic. Traditionally, caramelized fish in a clay pot is served with rice. At the top of the rankings is pempek from Indonesia, a fish cake made from ground fish meat and tapioca starch. It is followed by shorsheilish from Bangladesh, featuring hilsa fish cooked in a mustard sauce. Japan's maguro, otoro, and chutoro nigiri sushi round out the top spots, with each variety highlighting different cuts and qualities of tuna. Japan also leads the list with the highest number of dishes, totaling 18.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/ha-long-welcomes-first-international-cruise-ship-in-the-year-of-the-dragon-4711350.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-13&vn_term=Desktop", "title": "Ha Long welcomes first international cruise ship in the Year of the Dragon", "content": "Chinese-flagged cruise ship Zhao Shang Yi Dun carrying 600 passengers docked at Ha Long International Cruise Port in the northeastern province of Quang Ninh on Tuesday, the fourth day of the Lunar New Year. This is the first international cruise ship docking at the port in the Year of the Dragon. The tourists visited Ha Long Bay, experienced local culture and cuisine, visited Quang Ninh Museum and some famous attractions in Ha Long city. The Zhao Shang Yi Dun - a high-class cruise started to operate the Shenzhen - Ha Long route last November, with an average frequency of four times per month. According to the registrated schedule, it will continue to bring tourists to Ha Long on February 20 and February 27. By the end of this month, it will bring more than 12,000 passengers to Quang Ninh. The number of tourists coming to Ha Long by sea is forecast to recover, with nearly 60 cruise ships registered to dock at Ha Long International Cruise Port. In the first three days of the Lunar New Year (February 10-12), the port received 336 ships with nearly 11,000 visitors to Ha Long Bay, an increase of nearly 2.5 times compared to the same period of last year.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/bali-to-charge-foreigners-10-tourist-tax-4709049.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-49&vn_term=Desktop", "title": "Bali to charge foreigners $10 tourist tax", "content": "All foreign tourists will have to pay tourism tax of 150,000 rupiah (US$9.55) when they visit Indonesia's famous resort island Bali from Feb. 14. The new fee will be applicable to those visiting mainland Bali as well as its surrounding islands such as Nusa Penida, Nusa Lembongan and Nusa Ceningan, Bali authorities announced on its official website. Tourists arriving from other parts of Indonesia via land or domestic flights also have to pay the tax. Children are not exempt from the fee. They can make payment via the Love Bali website prior to their arrival. Upon payment, a tourism tax ticket will be sent via email, and tourists should store it on their cellphones for checking in Bali Airport and seaports. The tourist tax will be used to improve tourist services, preserve Balinese culture as well as improve the environment following recent tourism overcrowding, The Strait Times reported. Bali expects to attract 7 million tourists this year. Last year the island received 5.2 million arrivals. The island launched a crackdown on misbehaving tourists after a spate of incidents that disrespected the predominantly Hindu island’s culture.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/photo-of-cloud-covered-buddha-statue-in-southern-vietnam-wins-sony-global-contest-4709812.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-41&vn_term=Desktop", "title": "Photo of cloud-covered Buddha statue in southern Vietnam wins Sony global contest", "content": "Tran Tuan Viet is one of 54 National Award winners at this year's Sony World Photography Awards for his picture of a mountain-top Buddha statue standing amid clouds. There were 415,000 entries from 74,000 photographers from 206 countries. Viet said he took the photo last October when he took a cable car at dawn to go cloud hunting up Ba Den Mountain in Tay Ninh Province, the tallest in southern Vietnam at 986 m. Dubbed the roof of southern Vietnam, it is home to a number of Buddhist pagodas and temples. The 54 winners received Sony digital imaging equipment and their works will be exhibited at Somerset House in London, the U.K., next April. The entries were judged anonymously by a panel of judges. Since its inception in 2007, the Sony World Photography Awards has proven to be a platform for some of the world's most evocative photography.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/vietnam-has-one-of-worlds-most-incredible-beaches-lonely-planet-4707223.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-71&vn_term=Desktop", "title": "Vietnam has one of world's most incredible beaches: Lonely Planet", "content": "Ti Top beach in UNESCO heritage site Ha Long Bay was named one of 100 best beaches in the world by Australian magazine Lonely Planet. It was the only representative in Vietnam to break into the list that saw a total of 14 representatives from Asia. Ti Top island is located about 14 kilometers to the east of Bai Chay tourist area. It has a beach that is shaped like a crescent moon and known for its blue sea waters. The island was named after Russian cosmonaut Gherman Titov on his first visit to Ha Long Bay in 1962. In the middle of the island is a small path leading to Ti-Top peak with more than 400 stone steps. The higher you go, the higher and steeper the stone steps become. It takes around 20 minutes to climb onto the peak, but tourists will be rewarded with breathtaking views of Ha Long Bay dotted with limestone karst mountains rising out of the water. In Asia, White Sandy Beach in Maldives, Pink Beach in Indonesia, Pacifico Beach in the Philippines, Hat Tham PhraNang and Secret Beach in Thailand also made onto the list.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/tiktoker-goes-viral-for-praising-singapore-as-bucket-list-destination-4709498.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-43&vn_term=Desktop", "title": "TikToker goes viral for praising Singapore as bucket-list destination", "content": "British TikToker and content creator Leuan Jones has amused Singaporean netizens after showing his love to the city state and describing his visit to Gardens by the Bay as a “bucket-list thing.” His video posted on TikTok on Jan. 31 included a series of clips that show him gushing over the scenic views at Gardens by the Bay in the heart of Singapore. In the video, he could be seen covering in sweat under the sweltering heat in Singapore as he happily tells the camera: \"I'm boiling, I'm sweating from every single hole in my body. \"But I'm about to do a bucket list thing and I literally - I've wanted to do this for years - and I can't believe I'm here!\" His video quickly went viral on social media, attracting 287,400 views, 37,400 likes and 410 comments as of Tuesday, with many Singaporean netizens thanking him for promoting Singapore. One commented: \"Thanks for reminding us that Singapore is pretty nice. Many things to be thankful for.\" Another wrote \"As a Singaporean... I've never been there, but you hyped it up so I'm going to go.\" Many Singaporeans thanked Jones for showing love to Singapore and for sharing his first-ever experience, saying that his video had made them proud of the country and appreciate it more. Set in the heart of Singapore's downtown, Gardens by the Bay is home to a diverse collection of over 1.5 million plants that hail from every continent except Antarctica.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/how-to-make-12-hour-vu-dai-braised-fish-for-tet-4677741.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-69&vn_term=Desktop", "title": "How to make 12-hour Vu Dai braised fish for Tet", "content": "Vu Dai Village's braised fish, a winter delicacy with vibrant color and robust flavor, features fermented crab paste and lime juice for a distinctive taste. Vu Dai Village's braised fish in Ha Nam Province is a cherished specialty for reunions and festive occasions. The village often makes the dish in large number for sale ahead of the Lunar New Year (Tet) holiday. It is bought by Vietnamese across the country as a holiday specialty, and is also exported. This recipe serves about 4 to 5 people, takes approximately 3 to 4 hours to prepare, and provides around 2,200 calories in total. Ingredients - 800 - 900 grams of black carp - 200 grams of pork belly - 45 ml of fermented crab paste - Galangal, ginger, scallions, chili - Fish sauce, salt, sugar, stock powder, MSG, pepper, lime Instructions 1. Preparation a. Prepare the fish - Remove scales, gut and clean the fish thoroughly. - Rub the fish with salt and lemon to eliminate any undesirable odor. Several methods exist to eliminate the fishy odor when preparing fish, including rubbing with lime and salt, washing with rice water, using wine, and incorporating crushed ginger. - It is recommended to rub the fish again with a bit of sea salt to enhance the fish's firmness and flavor. The technique is mentioned as a secret used by the people of Vu Dai Village. b. Prepare fermented crab paste - After cleaning the crabs, manually pound them and filter to extract the juice. - Mix the juice with salt, thinh - powdered grilled rice, galangal, dried kumquat skins, and shallots, then transfer the blend into a sealed ceramic jar, placing it next to a wood stove. - Allow the mixture to ferment for approximately 7 days, during which time it develops a characteristic aroma. The longer the crab sauce is stored, the more fragrant and delightful it becomes. c. Prepare the spices - Slice half of the galangal to line the pot's bottom, and pound the remaining half for marinade. - Wash the ginger and slice it. - Extract the lime juice, a crucial component for removing any fishy odor and ensuring the tenderness of the braised fish, even its bones. 2. Marinade - Combine the following ingredients to season the fish: Ground galangal Scallions 3 tablespoons of fermented crab paste (45 ml) 2 tablespoons of fish sauce 2 to 3 tablespoons of caramel sauce 2 tablespoons of lime juice 2 teaspoons of sugar 1 teaspoon of salt 1 teaspoon of pepper 1/2 teaspoon of MSG or stock powder - Ensure thorough mixing and allow the fish to marinate for a minimum of 30 minutes to absorb the flavors. - For enhanced taste, a longer marinade time is recommended, especially if braising for an extended period. 3. Cooking process The distinctive aspect of Vu Dai Village's braised fish lies in the specific cooking equipment used: a clay pot with a lid, and longan wood. The pot should be cured by boiling in hot water for durability. The preparation is intricate, taking up to 12 hours to achieve firm, soft, flavorful fish pieces that are edible, even with bones. While these tools might not be readily available, you can recreate this recipe at home using standard cooking equipment by following the process: - To ensure the fish doesn't stick to the pot, line the bottom with galangal and ginger before placing the fish on top. For larger quantities, alternate layers of fish and crushed galangal for easy serving. - Meat is added later for a rich taste while keeping the pieces intact. When preparing the braised fish at home, the dish can undergo a double cooking process to closely emulate the traditional taste. a. First braising: - Boil the fish pot on high heat for 3-4 minutes to allow the fish to absorb flavor. - Add boiling water until the sauce evenly covers the fish's surface. It's crucial to use boiling water to prevent any fishy scent. - Reduce heat to low, open the lid, and simmer, seasoning accordingly. - After 40 - 45 minutes, turn off the stove, allowing the fish meat to become more firm. b. Second braising: - Heat the fish over low heat. - Add pork belly, occasionally tilting or using a spoon to distribute the stock evenly. - When the stock is almost gone, leaving 1/3 in the pot, add old boiling water to continue braising. - Braise the fish for 2 - 3 hours or longer if desiring softer bones. - Finish by sprinkling a little lard for shine and a beautiful color. Finished product: - The braised fish boasts vibrant colors and enticing aromas, with firm meat, edible bones, and the delightful fragrance of galangal.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/phu-quoc-welcomes-1000-thai-tourists-on-5-star-cruise-ship-for-first-time-4708096.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-62&vn_term=Desktop", "title": "Phu Quoc welcomes 1,000 Thai tourists on 5-star cruise ship for first time", "content": "The Italy-flagged Costa Serena cruise ship carrying over 1,000 tourists from Thailand docked at Duong Dong Port in the southern island of Phu Quoc on Friday. The tourists enjoyed musical performances and then visited tourist attractions on the island such as Ho Quoc Pagoda, Sun World Hon Thom tourist area and a pearl farming facility. This was the first Thai tourist group to visit Phu Quoc Island on a 5-star cruise. The Costa Sereni is 290 m long and 62 m high, offering a four-night voyage from Thailand to Cambodia's Sihanoukville and Phu Quoc. According to a report from the Kien Giang's Department of Tourism, Phu Quoc last year welcomed more than 500,000 visitors, including 82,000 foreigners.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/maldives-thailand-singapore-among-preferred-lunar-new-year-destinations-for-chinese-poll-4708904.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-52&vn_term=Desktop", "title": "Maldives, Thailand, Singapore among preferred Lunar New Year destinations for Chinese: poll", "content": "The Maldives is the top overseas destination for Chinese tourists during the upcoming Chinese Lunar New Year holidays, followed by Thailand and Singapore, a poll has found. Russia was fourth, followed by Japan and New Zealand, the survey of 25,000 respondents done by Global Times newspaper said. The rest of top 10 were Iceland, Switzerland, France, and Italy. Vietnam was absent from the list though China sent the largest number of tourists to the country before Covid. According to industry insiders, the top-ranked countries have friendly visa policies for Chinese tourists. Thailand and Singapore recently announced visa exemptions for Chinese visitors, and the Maldives allows them to apply on arrival. The Lunar New Year falls on Saturday, Feb. 10 and is widely celebrated in many Asian countries including Vietnam. Data from Chinese online travel agency Ctrip reveals tour bookings to Southeast Asia is up 1,026% from last year and air travel by 864%, China Daily reported.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/top-tourist-destinations-cash-in-on-tet-travel-rush-4711729.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-6&vn_term=Desktop", "title": "Top tourist destinations cash in on Tet travel rush", "content": "Crowds flocked to popular tourist destinations during the week-long Tet break and spent millions of dollars there. Ho Chi Minh City topped the country in terms of both arrivals and revenues during the country's biggest festival from Feb. 8 to 14. It received 1.8 million people, 6% more than last year and earned revenues of VND6.55 trillion (US$267.3 million), according to the Vietnam National Authority of Tourism. Hanoi was second in terms of revenues (VND2.35 trillion) and was followed by Da Nang City (VND1.58 trillion) and Kien Giang Province (VND930 billion), home to Phu Quoc Island. In terms of visitor numbers, northern provinces such as Ninh Binh, Quang Ninh and Ha Giang and the north-central Thanh Hoa Province saw increases of 50-64%. Hanoi, Da Nang and Khanh Hoa and Kien Giang provinces reported increases of 21-26%. There were also large numbers of foreign tourists at many of the destinations. Phu Quoc received 52,000 foreign visitors, nearly six times the number last year. The northern province of Ninh Binh, home to UNESCO heritage site Trang An Landscape Complex, saw their number quadruple to 115,000. Hanoi saw a 2.2-fold increase to 103,000, and Quang Nam, home to Hoi An, received 97,000, up 42%. HCMC received 75,000, a 15.4% rise. The tourism authority said the sharp rise in foreign visitor numbers was due to the flexible visa policies. There were also 10.5 million domestic travelers, a 16.6% increase.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/singapores-most-prestigious-university-imposes-entry-fee-following-tourist-disruption-4710005.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-39&vn_term=Desktop", "title": "Singapore's most prestigious university imposes entry fee following tourist disruption", "content": "Nanyang Technological University, one of Singapore's top universities, plans to charge an entry fee on tour groups to prevent large crowds of tourists that cause a nuisance on students. The move came after many foreign tourists recently flocked to the university's campus for sightseeing and photography, triggering noise and disruption, Channel News Asia reported. The university's management board announced it would require all travel agencies planning tours to the campus to seek prior approval as well as pay the fee. The fees are \"intended to support campus maintenance and the regulation of vehicle flow\" and to \"ensure a sustainable visiting experience,\" it said in the announcement as cited by The Strait Times. However, it didn't reveal how much the fee would be or when it would be implemented. Many students at the university earlier complained on social media that they faced distractions from tourists taking photos and peeping over their shoulders at The Hive building, whose facade bears a resemblance to dim sum baskets. Some tourists have even entered classrooms, disrupting student lessons.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/korean-blogger-loves-vietnamese-meal-hospitality-4703478.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-23&vn_term=Desktop", "title": "Korean blogger loves Vietnamese meal hospitality", "content": "Park Wow Sung, a South Korean content creator, loves the subtle nuances of the ways in which Vietnamese host guests for home-cooked meals featuring an array of dishes. Park's work boasts nearly 400,000 likes on his TikTok channel and a YouTube channel with over 150,000 followers. Having spent 15 years in Ho Chi Minh City, he is not only fluent in Vietnamese, but also harbors a deep passion for Vietnamese cuisine. In fact, he even ventured into the culinary realm by opening a Vietnamese restaurant in central Seoul, South Korea. Driven by his love for the culture of Vietnam, Park shares content on social media platforms in Vietnamese. His posts often explore Vietnamese food and dining customs. In a TikTok video posted at the close of 2023, Park delved into the customs Vietnamese people employ when hosting guests for meals. Drawing from firsthand experience, he noted that Vietnamese are fond of inviting friends over, urging them to stay for dinner, and then serving an array of vastly diverse dishes. What intrigued him most was Vietnamese hosts' tendency to not just prepare a single dish, but to create a multi-faceted feast. In the video, Park captured the scene when a Vietnamese friend invited him to home to serve him a spread of dishes such as steamed sausage, fish soup, and duck. According to Park, Vietnamese find joy when their guests indulge heartily in the food served, but they also express disappointment when guests consume less. The video garnered nearly 1 million views, drawing attention from the Vietnamese online community, with many expressing interest in the Korean blogger's fluency in Vietnamese and his understanding of Vietnamese culture. The majority of comments aligned with Park's sentiment that Vietnamese people are exceptionally hospitable. One follower commented: \"When visiting a relative's house, if you decline an invitation to eat, the host might scold you, saying things like if you don't eat, you aren't really family.\" However, some Vietnamese viewers spotted a cultural oversight in the video when Park accidentally received the food from somebody else with his chopsticks during the meal. In Vietnamese culture, when receiving food from someone else, one must make sure to receive it directly in their bowl, avoiding the transfer of food between chopsticks. Avoiding this taboo is believed to steer one clear of potential bad luck. This isn't the first time the warmth of Vietnamese hospitality has left an impression on foreign writers. Matthew Pike, a blogger, and Culture Trip travel site reporter who also once resided in Saigon, expressed his admiration for Vietnamese people, emphasizing their hospitality in an article. \"It's quite usual to witness groups of tourists being welcomed into local homes for a meal. Particularly during festivals, you might be treated to local cuisine and revel in festivities until the late hours. This is an aspect of Vietnamese culture that never fails to leave a positive impression on international tourists,\" according to Pike.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/nearly-300-taiwanese-tourists-stranded-in-vietnam-as-tour-company-defaults-on-payment-4711430.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-12&vn_term=Desktop", "title": "Nearly 300 Taiwanese tourists stranded in Vietnam as tour company defaults on payment", "content": "The failure by a Taiwanese tour company to pay its Vietnamese partner has left 292 of the former’s clients stranded on Phu Quoc Island. The visitors had booked a four-day tour to the island through We Love Tour company in Taipei and flew in by charter flight on Feb. 10, Lunar New Year’s Day. Hoang Tuan Minh, director of local travel agency Winner Vietnam, which was to provide them with services, told VnExpress that the Taiwanese partner had agreed to make full payment by Jan 31. But it failed and so he had canceled the contract, he said. But the Taiwanese company went ahead and sent the group to Phu Quoc, where there were no vehicles and hotels or waiting for them. It contacted Minh and pleaded with him to take care of the visitors. He agreed for \"humanitarian\" reasons and sent 18 buses and Chinese-speaking guides to Phu Quoc airport and lodged the visitors at two five-star hotels. The Taiwanese company had promised to pay on Feb 11. But it again failed to pay, and Minh informed the company that he would no longer serve the tourists. He had spent billions of dong (VND1 billion = US$40,700) already. The Taiwanese company then told the tourists to pay him $720 each, promising to refund the money later, but only around 90 of them agreed. Many complained on social media, prompting authorities to step in. Taipei Economic and Cultural Office, which manages Taiwanese affairs abroad, got in touch with both sides, telling the Taiwanese company to make full payment by Feb. 26 and Minh to continue hosting the tourists. The former company has not paid for the visitors’ return flight tickets either, and it remains to be seen if they can board an airplane on Feb 14 as scheduled. Bui Quoc Thai, director of the Department of Tourism of Kien Giang Province, where Phu Quoc is situated, said an inspection team has been formed to look into the dispute.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/hcmcs-tet-fireworks-river-cruises-unfilled-4708381.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-55&vn_term=Desktop", "title": "HCMC's Tet fireworks river cruises unfilled", "content": "Just a few days before the Tet holiday break, Saigon River cruise providers say the number of bookings to watch this Lunar New Year's Eve fireworks remains low. Hoang Van Thuy, manager of GreenLines DP Company, said many potential customers had called his company asking about Tet fireworks cruise tours, but very few had actually made reservations. GreenLines currently has two yachts that can accommodate 12-20 people, with prices ranging from VND15-20 million (US$616-821) each per cruise. Lieu Thi My Hanh, CEO of Les Rives Company, said her company has three yachts and 14 other boats providing tours along the Saigon River. It offers a cruise tour that allows guests to watch fireworks on Lunar New Year’s Eve and enjoy the city nightlife, combined with light meals. The tour departs at 10 p.m. on Feb. 9 and ends at 1 a.m. the next day with tickets costing VND4 million per person. Hanh said that although Tet is approaching, the number of tourists registering for cruise tours on Lunar New Year’s Eve has decreased by half compared to the Gregorian New Year holiday. Tour purchasing power has decreased because many tourists prefer traveling to other parts of the country due to long vacation, she added. Hanh also said that her major customer bases of overseas Vietnamese and foreigners living and working in Vietnam often return home to visit family during Tet, leading to a significant decrease in sales at her company. During this year’s Gregorian New Year holiday, her two yachts, each with a capacity of 40 guests, were completely booked. King Yatch cruises also offer a tour program for VND1.7 million per adult and VND1.2 million for children that still has plenty of spaces available for Lunar New Year’s Eve. In addition to luxury cruise ships, visitors can experience watching the Saigon River fireworks show at a lower cost, below VND500,000 per person, on double-decker river buses. Nguyen Kim Toan, director of a travel company which runs the double-decker river bus tour, said his number of booking on Lunar New Year’s Eve is so far also lower than the New Year's Eve. He posited that in addition to visiting their families, many potential customers were also traveling to more popular tourist destinations for the holiday instead. According to statistics from the travel platform Mustgo, downtown HCMC’s 5-star hotels with the best views for the fireworks still have many vacant rooms for this upcoming Lunar New Year’s Eve. The fact also stands in contrast to the last New Year's Eve night, when occupancy rates reached about 80% capacity. This year, the city will have fireworks displays at 11 venues, five more than last year. The two highest-altitude fireworks shows will take place at the Saigon River Tunnel in Thu Duc City and Ben Duoc Martyrs Memorial Temple in Cu Chi District.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/people-flock-to-tourism-destinations-on-last-3-days-of-tet-holidays-4711263.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-14&vn_term=Desktop", "title": "People flock to tourism destinations on last 3 days of Tet holidays", "content": "With businesses reopening in many tourism hotspots on Monday, the number of people visiting them is expected to surge during the remainder of the holiday. Most hotels and homestays in downtown Da Lat that VnExpress contacted are occupied from Sunday to Thursday. The major attraction in the Central Highlands, known for its cool climate and flowers, saw the number of tourists between Feb. 8 and 12 jumping by 22.4% from the same period last year, according to local authorities. \"People filled downtown streets on Monday,\" a tour guide said. Tourists started to arrive in the beach town of Phan Thiet in central Vietnam on Monday, which was the third day of the New Year. It is a tradition for people to spend the first two days of the year with family and relatives. Ky, the owner of a homestay there, said all rooms are booked for Tuesday, and occupancy is 90% between Sunday and Thursday. Phu Quy Island, another travel spot in the central province of Binh Thuan, saw an influx of tourists on Tuesday. Over 1,000 have registered to visit the island on Tuesday, Nguyen Van Linh, deputy director of Phu Quy Tourism Company, said. He added that boat services were suspended during the previous three days since the weather was not good. Huynh Ka, who owns a local homestay, said the weather has become fine and businesses are ready to welcome tourists. Vung Tau beach town in the southern province of Ba Ria – Vung Tau also saw large numbers of visitors arrive on Monday, mostly from nearby localities. Many were seen on the beach on Monday despite strong waves, and parking lots were full. Local authorities reported the arrival of 130,000 visitors on Sunday and hotels had 45% occupancy. Phu Quoc Island recorded 192,000 arrivals between Feb. 8 and 12, up 43% year-on-year, with tourism revenues estimated at VND704 billion. Thua Thien Hue Province, Vietnam’s former capital in the central region, saw a 17% spike in the number of tourists to 100,000, and hotels reported occupancy of 62%. In HCMC, the country’s biggest city, many businesses are remaining open through the seven-day holiday. Nguyen Kim Toan, director of Thuong Nhat Company, said the company’s boat service has been operating non-stop. Seven to nine trips are made daily with around 50 passengers each, 5-10% of them foreigners. The Hop On Hop Off open double-decker has been operating 24 hours each day during the holidays, making 48 trips daily, and is mostly fully occupied. Tourism company Vietfluxtour reported a 50% year-on-year rise in its customer numbers. HCMC received 75,000 tourists during the Tet holidays, a 15.4% increase, and reported tourism revenues of VND6.55 trillion.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/vietnam-s-rare-dragon-chickens-all-the-rage-for-lunar-new-year-4710571.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-31&vn_term=Desktop", "title": "Vietnam's rare 'dragon chickens' all the rage for Lunar New Year", "content": "Known for their strangely large feet, Dong Tao chicken has for generations been a delicacy in Vietnam and mostly consumed during the Lunar New Year holiday. The rare breed of poultry, also known as dragon chicken, feature a pair of scaly red feet as large as a beer can, originates from Dong Tao, a village 30 kms (18 miles) southeast of Hanoi. Dong Tao chicken, weighing up to 6 kg (13 pounds) each when fully grown and once reserved only for the royals, are believed to bring good fortune and wealth to their owners. Today, demand for Dong Tao chicken, whose meat has a crunchy texture, a distinct fragrant aroma and a rich flavor, has risen sharply, backed by a growing number of wealthy people in one of Asia's fastest-growing economies. \"A fully grown dragon chicken of at least one year old farmed in Dong Tao village is sold for up to 5 million dong ($205.38) or sometimes even 10 million dong,\" said Le Trong Dung, a chicken farmer in the village. Nguyen Thi Hong Nhung, a local chicken farmer, said the most valuable parts of the chicken are its legs, as she held a two-year-old rooster in her hands. Loc Duc Toan, a 25-year-old chef in Hanoi, said a Dong Tao chicken has its best taste at the age of 13 to 15 months, adding that steaming is one of the best ways to cook it. \"When steamed, the skin will be crispy with a fragrant aroma of its own and a sweeter meat compared to other normal chicken,\" Toan said. The chickens are now also raised beyond the village, offering a chance for a wider range of consumers, but according to local agriculture official Phan Van Hieu, those raised in the village and fed purely with paddy rice and corn have the best taste. \"Production hasn't met domestic demand yet,\" Hieu said. \"I'm sure you won't find any Dong Tao chicken in any KFC restaurants in foreseeable future.\"", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/vietnamese-villages-transformation-from-cow-barns-to-tourist-charms-4704834.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-16&vn_term=Desktop", "title": "Vietnamese village's transformation from cow barns to tourist charms", "content": "Lo Lo Chai Village in Ha Giang Province has transformed as residents shift to tourism, adapting the homestay model by converting cow shelters into guest bedroom. ", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/phu-quoc-hoi-an-brace-for-tet-tourist-influx-4708024.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-56&vn_term=Desktop", "title": "Phu Quoc, Hoi An brace for Tet tourist influx", "content": "Popular tourist destinations like Phu Quoc, Hoi An and Da Lat have reported hotel occupancy rates of over 90% during the upcoming Tet holidays starting next week. Bel Marina Hoi An Resort and Emerald Hoi An Riverside Resort said occupancy would be over 95%, and 97%, with the latter booked mainly by South Korean tourists. On Phu Quoc Island, three-star hotels and resorts are fully booked. Luxury villas on the southern tip are nearly full to an influx of foreign tourists, according to Mustgo, a booking platform with 2,000 hotel partners in the country. The Central Highlands city of Da Lat, expected to be the most crowded destination during Vietnam's biggest holidays, also reported occupancy rates of 90%. Colline Hotel near Da Lat Market is fully booked from Feb. 12-15 while MerPerle Hotel has no rooms available from Feb. 10-16. The Lunar New Year starts on Feb. 10. But in the central region between Da Nang and Phan Thiet, hotels have lots of rooms available. In Nha Trang and Cam Ranh, international five-star hotels reported average occupancy of over 50% but local properties are doing better at around 80%. A spokesperson for Movenpick Cam Ranh said the hotel was 55% booked between Feb. 10 and 14, with the guests mostly being South Korean and Chinese tourists. In popular beach city Quy Nhon, occupancy rates are 30-35% for the five-star segment and 50% for the three- and four- star segments. Many hotels in Da Nang have waived Tet surcharges to attract tourists, but three- and four-star hotels there only reported 40% occupancy. In Vung Tau and Phan Thiet, they are nearly 70% for five-star hotels and 30-40% for others.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/australian-newspaper-introduces-nine-best-things-for-tourists-to-do-in-vietnam-4707907.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-63&vn_term=Desktop", "title": "Australian newspaper introduces nine best things for tourists to do in Vietnam", "content": "Herald Sun, one of the oldest and most widely read newspapers in Australia, has listed the nine best things for tourists to do when visiting Vietnam. The article affirmed as affordable as it is vibrant and varied, Vietnam is fast becoming a destination of choice for Australian holidaymakers. The first activity spotlighted by the newspaper is the UNESCO World Heritage Site of Ha Long Bay in Quang Ninh Province. The best way to explore Ha Long Bay, which is Vietnam’s best known natural attraction, is from the water, the newspaper said, adding that a six-hour boat tour is an ideal way to introduce yourself to the majesty of the region. It also mentioned some activities that tourists should experience in the bay such as visiting caves and Ti Top island to relax on the beach and try a bamboo row boat. The other activities include visiting Cu Chi Tunnels in Ho Chi Minh City; exploring HCMC on two wheels; taking in a water puppet show at the Golden Dragon in HCMC, eating in Hanoi, walking the ocean floor in Nha Trang, shopping, cooking and eating at a floating market, trekking hills of Sa Pa and visiting train street in Hanoi.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/thailand-australia-to-consider-visa-waivers-4711664.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-7&vn_term=Desktop", "title": "Thailand, Australia to consider visa waivers", "content": "Thailand and Australia have agreed to consider the possibility of introducing a mutual visa exemption scheme for travel and business activities between the people of both nations. The proposal was raised during a meeting between Thai Prime Minister Srettha Thavisin and the Governor-General of Australia David Hurley in Bangkok on Feb. 14. At the meeting, Srettha affirmed the Thai Government's commitment to taking measures to promote tourism, including those to ensure safety and create favorable conditions for tourists' travel activities. Hurley and his spouse are on their four-day visit to Thailand from Feb. 14-17 to promote the relations between Australia and Thailand. They are scheduled to have a royal audience with Their Majesties the King and Queen during the visit.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/vietjet-inaugurates-hcmc-chengdu-route-4711024.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-21&vn_term=Desktop", "title": "Vietjet inaugurates HCMC - Chengdu route", "content": "Vietjet inaugurated a route connecting Ho Chi Minh City of Vietnam and Chengdu of China on Feb. 10 – the first day of the Lunar New Year, opening up opportunities for easy travel between the two countries. Vietjet operates seven return flights per week between HCMC and Chengdu, with a flight time of over four hours per leg. Located in Southwestern China, Chengdu is an important gateway connecting many cities in China and the world, where is the \"homeland\" of Pandas or easily going to Jiuzhaigou - a world heritage site recognized by UNESCO. Meanwhile, HCMC is a trade center in the region and an attractive destination with diverse culture and Vietnamese unique street food, easily connecting to Vietjet’s international network. On the first morning of the Year of Dragon, passengers flying with Vietjet at airports across the country were welcomed with lucky money.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/da-nang-ha-long-receive-thousands-of-tourists-on-first-day-of-lunar-new-year-4711107.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-25&vn_term=Desktop", "title": "Da Nang, Ha Long receive thousands of tourists on first day of Lunar New Year", "content": "The Da Nang International Airport in the central city of the same name welcomed more than 125 domestic and international flights carrying over 17,000 passengers on Feb. 10, the first day of the Year of the Dragon. The airport served 53 international flights with some 7,500 passengers aboard on the day. Up to 894 domestic and international flights are expected to arrive at the airport during the seven-day holiday, beginning Feb. 8, up about 16% year-on-year. The municipal Department of Tourism, the airport, the Da Nang International Terminal Investment and Operation JSC and air carriers jointly held a ceremony to welcome the first holidaymakers. The same day, the central city welcomed the first international cruise ships in the lunar year with more than 1,800 passengers. Last year, the city served 22 cruise ships with more than 18,000 passengers. The numbers are expected to reach over 45 and more than 50,000 this year, respectively. Nearly 362,000 tourists are hoped to visit the city during the holiday, a rise of 23% from the corresponding time last year, including 172,000 international and 190,000 domestic. The northern province of Quang Ninh, home to UNESCO-recognized Ha Long Bay, also welcomed the first group of nearly 300 visitors from the Republic of Korea (RoK) to the heritage on the day. Pham Van Hiep, Managing Director of the Ha Long International Cruise Port, said around 2,000 international tourists visited the bay on the day. Ha Long Bay is expected to attract some 1.4 million vacationers this year, up 25-30% from the previous year. According to the provincial Department of Tourism, Quang Ninh province aims to lure at least 17 million arrivals in 2024, including 3 million international visitors. The northern province of Ninh Binh, known for its Trang An Landscape Complex that was recognized by UNESCO as a World Cultural and Natural Heritage Site in 2014, has organized a range of activities to welcome the first tourists in the lunar year, striving to fulfill the yearly target of serving 7.5 million visitors, of them 900 are international ones.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/phu-quoc-welcomes-2000-european-visitors-ahead-of-lunar-new-year-4710652.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-29&vn_term=Desktop", "title": "Phu Quoc welcomes 2,000 European visitors ahead of Lunar New Year", "content": "Cruise ship Aida Bella brought 1,979 European tourists to Phu Quoc Island on Friday, the last day of the lunar year. The group are scheduled to explore Phu Quoc night market, Vinwonders entertainment complex, and Vinpearl Safari, take cable cars to Hon Thom island, and visit Hon (kissing) bridge. They will also enjoy the best beaches of Phu Quoc and small islands, visit traditional craft villages, and try local dishes before leaving the island at night on the same day. Earlier on Feb. 2, Italian-flagged cruise ship Costa Serena also carried 1,100 foreign tourists to Phu Quoc. Bui Quoc Thai, Director of the Kien Giang Department of Tourism, said that since the beginning of this year, especially on the threshold of the Lunar New Year (Tet) holidays, Phu Quoc has welcomed a large number of foreign tourists, signaling a good year for the local tourism sector. So far this year, the famous tourist destination has served more than 502,000 travelers, including 82,615 foreigners, up 6.1% year on year, earning about VND1.76 trillion (US$72.05 million).", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/asias-best-chicken-dishes-include-4-from-vietnam-4706470.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-51&vn_term=Desktop", "title": "Asia's best chicken dishes include 4 from Vietnam", "content": "Four Vietnamese chicken dishes, with lemongrass, curry, salad, and boiled, have made the list of \"65 Best Chicken Dishes in Asia\" put out by cuisine magazine TasteAtlas. Lemongrass chicken, chicken curry, shredded chicken salad, and boiled chicken were 36th, 39th, 57th, and 60th. Lemongrass chicken, a much beloved dish in the Mekong Delta, is made by marinating the meat in a mixture of lemongrass, chili, shallot, garlic, sugar, salt, oil, turmeric powder, and fish sauce. The chicken is then stir-fried and simmered until tender, and usually served with hot rice or noodles. Vietnamese chicken curry is an adaptation of the Indian variety, and the meat is cooked with potato, carrot, onion, garlic, coconut milk, chicken broth, and flavoring like lemongrass, fish sauce, bay leaf, and curry powder. It is served with white rice or bread. Shredded chicken salad is a blend of sweet, savory, crunchy and tangy ingredients like boiled chicken, carrot, onion, cilantro, mint, and, occasionally, cabbage. The ingredients are mixed in a bowl and dressed with a mixture of lime juice, fish sauce, chili, garlic, and sugar. It is garnished with roasted peanuts and crispy fried shallot before serving. Boiled chicken, a traditional Chinese dish, has gained popularity in northern Vietnam, especially during the Lunar New Year, symbolizing abundance and prosperity. It involves cooking a whole chicken with ginger, salt, scallion, and turmeric powder, giving it a golden appearance. After boiling, the chicken is cooled in ice water to halt the cooking process and prevent darkening. The dish is often accompanied by a salt and lime dip and served with sticky rice. The top five chicken dishes in Asia are Indian butter chicken and tikka (barbecued in a clay oven), Indonesian ayam goreng (fried chicken seasoned with spices), and Korean fried chicken and dak galbi (stir-fried chicken with a spicy-sweet sauce and vegetables).", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/phu-quoc-poised-to-become-wedding-destination-of-global-billionaires-4707036.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-67&vn_term=Desktop", "title": "Phu Quoc poised to become wedding destination of global billionaires", "content": "Indian billionaires have been hosting lavish weddings on Phu Quoc Island recently, boosting its global profile to the point that the island city may become a top super-rich wedding destination. From Jan. 19-23, Phu Quoc was chosen as the venue for the super wedding of a wealthy Indian couple. Although numbers were not specifically disclosed, a source told VnExpress said the amount of money they spent was \"really huge\" as the families rented an entire 5-star resort in the most expensive area of Phu Quoc Island, as well as the \"Kiss of The Sea\" floating stage located in waters just off the shore on the southern side of the island. The resort's room rates are up to VND160 million (US$6,538) per night, while the stage is capable of accommodating 5,000 seats, and the daily admission price is VND1 million per person. Huynh Quang Hung, chairman of Phu Quoc City People's Committee, said that weddings of the super-rich and influential international figures will create positive media effects on the island's tourism image. In the past year, the city also organized promotional programs in India to lure billionaires into holding their weddings there. \"In addition to India, we also aim to become a super wedding venue for billionaires from other countries,\" Hung said. He also revealed that Phu Quoc will soon host the super wedding of a billionaire from the United Arab Emirates after Lunar New Year holiday later this month. Phu Quoc is attractive to the wealthy and powerful due to its beautiful beaches, and the island resort destination boasts more than 30,000 hotel rooms, including 17,000 rooms at 5-star accommodation facilities. In Phu Quoc, billionaires can find unique tourism sites, such as Kiss Bridge, which recently gained international attention. In addition, in the Mediterranean Town area, fireworks displays last 7-10 minutes every night, while the southern tip of the island is home to big names in the global hospitality industry, which boast accommodation facilities of the highest class. John Paul Woolley, manager of JW Marriott Phu Quoc Emerald Bay Resort & Spa, said that in the past three months, the resort successfully hosted three \"super weddings\" for Indian couples. He said the facility has an experienced planning team that has honed their skills creating lavish, bespoke experiences for Indian customers. One of the important factors for a successful Indian \"super wedding\" is cuisine. Indian guests love food and have diverse dietary requirements, requiring chefs to build a special and rich menu. The complex’s rare location in the Khem Beach area also brings visitors the romantic atmosphere of clear blue sea water and white sand beaches, Woolley said. \"Phu Quoc is emerging as an attractive beach tourism destination, completely different from other international destinations such as Bali, Phuket, and domestic cities such as Da Nang and Nha Trang,\" he said. Woolley said the Indian wedding tourism market will grow strongly in 2024. Hoang Anh, who participated in organizing two super weddings for Indian billionaires, said after choosing Phu Quoc as the venue to organize a super wedding, the bride and groom's families often cover the cost of the entire resort, including meals, and additional services for all members of the party and their guests. And what’s more, guests often choose to travel and explore the island after the wedding ends. \"They really like Phu Quoc's specialties and often buy them as gifts,\" Hoang Anh said. However, he said Phu Quoc still has much to do to become a top wedding destination for the super-rich. Billionaire couples often request modern equipment and classic cars for their wedding, but Phu Quoc has very few providers of such services. Classic cars serving bridal processions are often brought in from Ho Chi Minh City, causing costs to increase. The increased amount of money sometimes make wedding organizers unhappy because Phu Quoc does not have enough professional services, Anh said. Vu Tien Van, chairman of the Board of Directors of Adavigo, a tourism unit specializing in the Phu Quoc market, also said that the billionaire wedding market is rich in potential but has not yet been realistically explored in Vietnam. Currently, Phu Quoc and other cities have only just laid the first bricks of this industry and there are still many difficulties ahead, Van said. Indian billionaire weddings could spark a travel fever for other Indian tourists. And this is the potential customer group that the Vietnamese tourism industry should target to avoid dependence on the Chinese market, he added.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/where-to-watch-tet-fireworks-in-saigon-4710535.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-30&vn_term=Desktop", "title": "Where to watch Tet fireworks in Saigon", "content": "Ho Chi Minh City has 11 locations with fireworks shows for Lunar New Year's Eve that will run for 15 minutes starting at 12 a.m. Saturday, and people can enjoy the shows from public places, cafes, or restaurants. The Saigon Riverside Park is one of the best locations to watch the high-altitude firework performance over the Saigon River Tunnel entrance in Thu Duc City. The new park spans 20 ha and has only just opened to the public in late December last year. It has since become a popular destinations for tourists and locals alike. People should come early to get the best spots for firework viewing. Bach Dang Port Park is another great location, about 4 km from the firework show at the Saigon River Tunnel. The park is large and faces directly towards the fireworks area. The park itself is also a popular destination for tourists and locals. The Ben Duoc Martyr Memorial site in Cu Chi District is the second location for high-altitude fireworks shows in HCMC. The site is 55 km from downtown areas, and is a popular site known for its cultural and historical structures, such as the Cu Chi Tunnels. Other fireworks shows will be held at: - District 7 Administrative Center Square - The Binh Tri Dong B neighborhood in Binh Tan District - The Cu Chi District Cultural House - Dam Sen Park in District 11 - Van Hoa Park in Go Vap District - Ben Noc Memorial Temple in Thu Duc City - Rung Sac Square in Can Gio District - Lang Le-Bau Co Relic Site in Binh Chanh District - The Nga Ba Giong Historical Site in Hoc Mon District. There are cafes and restaurants downtown suitable for firework viewing as well. The Katinat at the Bach Dang Port will stay open until 2 a.m. The cafe has been operating since December last year, and has a view that encompasses both the Saigon River and the Ba Son Bridge. Cao Oc & Beer in District 1, in the midst of the Bui Vien backpacker quarter, has a rooftop view over District 1 towards the show at the Saigon River. Reservations for tables are needed beforehand. The Landmark81 Skyview, located 400 m in the sky, has a citywide view. People can enjoy cocktails and take photos from the balcony patio. Ticket prices range between VND405,000-810,000 (US$16.58-33.16), and there are several restaurants and bars near the location. The Afterglow Sky Bar is located on the 6th floor of a building on Xuan Thuy, with the view pointing towards the Thu Thiem Tunnel and Landmark81. People need to book tables beforehand, and the sofa lounge area requires down payments. Beverage prices range from VND150,000-399,000. The Black Lounge, located on the 75th and 76th floors of the Landmark81, is located 5 km away from a firework show. The lounge takes a limited number of customers from 8 p.m.-11 p.m., so people need to book tables beforehand. People can also watch the fireworks from boats and cruise ships on the Saigon River, for ticket prices between VND179,000-4 million.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/hanoi-launches-night-tours-to-explore-sword-lake-temple-4707478.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-70&vn_term=Desktop", "title": "Hanoi launches night tours to explore Sword Lake temple", "content": "A nighttime tourism program to discover the Ngoc Son Temple on Sword Lake in downtown Hanoi, debuted at a ceremony on Jan. 31. As a blend of the ancient architecture of the special national relic site and its associated rituals and folklore, it utilizes sound, light, and modern projection technology to showcase Vietnam's traditional cultural values. Organized on evenings of the first four days of the week starting February, each tour under the experimental program lasts for 60 minutes and serves between 60 and 70 visitors. At the launch ceremony, head of the municipal heritage management board Nguyen Doan Van hoped that with the program, the special national relic site of Sword Lake and Ngoc Son Temple is no longer just \"resources\" but will become products of the cultural industry, capable of attracting a wide range of tourists both domestically and internationally. The capital city is striving to achieve the goal of the cultural industry contributing about 5% to its GRDP by 2025 and 8% by 2030.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/indonesia-arrests-3-mexican-nationals-after-tourist-shot-in-alleged-robbery-4707059.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-74&vn_term=Desktop", "title": "Indonesia arrests 3 Mexican nationals after tourist shot in alleged robbery", "content": "Indonesian police said Tuesday they have arrested three Mexicans for alleged robbery on the resort island of Bali that left a tourist from Turkey badly wounded. The arrests were made Saturday at a villa in Ungasan village of Badung district in Bali where the Mexican men had been staying since Dec. 7 as tourists, Bali Police spokesperson Jansen Avitus Panjaitan said. The three men who were arrested and a fourth Mexican man broke into a villa near the popular tourist spot of Kuta last week after pointing their guns at a security guard and forcing him to surrender, Panjaitan said. The four men armed with three guns sprayed bullets toward several guests who ran out of the villa for safety. The suspects stole U.S. dollars and Indonesian currency worth about $5,900 from the villa, and shot a 39-year-old Turkish man in his stomach, left hand and left back chest, police said. The suspects planned the robbery by preparing guns and surveilling the targeted villa, police said. Surveillance camera recordings and witness accounts led police to the four Mexican suspects, one who was still being sought and three who were paraded at the news conference wearing handcuffs and orange vests.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/five-rules-for-being-a-civilized-tourist-traveling-abroad-4709663.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-19&vn_term=Desktop", "title": "Five rules for being a civilized tourist traveling abroad", "content": "There are behaviors that are considered normal in everyday life, but are not appropriate when traveling in many countries around the world. Many tourists are unfamiliar with the cultures of other countries, which can leave them in trouble while traveling abroad. Here are tips shared with VnExpress reader Trinh Hang, who has traveled to dozens of countries around the world. Self-discipline anywhere, anytime Some tourists only comply with regulations when there are traffic police, ticket checkers or security staff. Many countries around the world have minimized supervisors, replacing them with camera systems that tourists may not see. All illegal acts such as littering, breaking red lights, smoking in prohibited places, evading tickets at tourist attractions and writing graffiti on monuments can be recorded by camera footage. Therefore, it is best for you to voluntarily comply with the laws of the country where you are visiting. Get ready to line up Many tourists when traveling abroad are annoyed by having to queue to go to the restroom, buy food, or pay for tickets. Tourists sometimes have to queue for several hours to watch an art exhibition, or visit a UNESCO heritage site. In fact, queuing is a common civilized behavior around the world. The more popular the tourist attractions are, the more people will have to wait in line, and tourists should get used to it. Some places have a clever solution that allows visitors to enter directly without queuing, but they have to pay additional fees. Eat everything on your plate Ordering a lot of food and drink and then leaving massive leftovers is a bad habit for tourists. Food waste has become a top concern in many countries where wasting food can even incur official punishments. Some places even charge extra money for customers who leave food behind. Leaving leftover food not only makes other diners feel uncomfortable, but it can also hurt the chef, waiter, and restaurant owner. Be on time Many tourists have suffered delays or had their travel experiences canceled due to their own unpunctuality. When visiting a foreign country, there may be many unforeseen situations, so give yourself time to handle unwanted things. That way, you will always be on time no matter what happens. Respect common space While traveling abroad, tourists should limit making noise (including listening to music or talking) and reduce taking up space such as putting luggage on someone else's seat, and instruct accompanying children not to be mischievous. Especially in places with specific regulations on hours and dress codes, people should try to respect these rules. For example, in the train cabin, you should not turn on the lights after 10 p.m. While in the museum, you should not use flash when taking photos. And in the restaurant, you should not ask for the air conditioning to be too cold.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/thailand-welcomes-nearly-4-million-foreigners-in-january-4711026.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-20&vn_term=Desktop", "title": "Thailand welcomes nearly 4 million foreigners in January", "content": "Thailand's tourism industry saw a strong start to 2024 with nearly 4 million foreign arrivals in January, the government’s spokesperson Chai Wacharonke said on Feb. 10. Thailand welcomed 128,969 foreign visitors on Feb. 8, two days ahead of the Lunar New Year. As of the same day, visitors from China topped the list with 730,747, followed by travelers from Malaysia (419,116), Russia (275,641), India (209,431) and Laos (130,551). Factors contributing to the huge increase in Thailand’s travel could be the need to travel after outbreak restrictions have been lifted in China, and the Thai Government’s free visa policy, said Chai. Apart from attracting visitors from China, the Thai Government has been building positive relations with ASEAN members to promote mutual tourism in the region. One of the notable initiatives is the \"One Destination\" project that aims to promote tourism in six countries among their citizens as well as global visitors, with participants including Thailand, Cambodia, Malaysia, Vietnam, Laos, and Myanmar, he added.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/chinese-tourists-in-hot-water-for-criticizing-malaysian-food-4709486.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-42&vn_term=Desktop", "title": "Chinese tourists in hot water for criticizing Malaysian food", "content": "Videos of two Chinese tourists defaming Malaysian food have circulated widely on social media, sparking online outrage. In the footage shared on Chinese social media platform Douyin, a Chinese man was seen advising fellow Chinese tourists to bring instant noodles when visiting Malaysia, criticizing the local food for lacking taste. \"Not only is the food in the restaurants here not delicious, but even the instant noodles are not tasty. You might have to bring instant noodles from home that suit your taste,\" the tourist said. Another video showed another Chinese tourist trying roadside noodles in Malaysia, describing them as \"not very good.\" He then goes on to suggest his fellow tourists bring their own instant noodles and pickled vegetables. The tourists even joked that traveling in Malaysia is an effective way to lose weight. The video’s translation has stirred outrage among Malaysia netizens who condemned the tourists’ behavior as \"inappropriate and disrespectful\" towards the country’s culture and cuisine, Malaysia’s The Sun news site reported. A netizen urged them to visit reputable restaurants before making unfair judgements. Another also suggested the tourists take some time to explore and discover hidden gems in Malaysia. Malaysia this year aims to attract 5 million Chinese tourists, three times higher than last year's figure.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/5-budget-friendly-getaways-near-saigon-to-escape-tet-crowds-4706468.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-44&vn_term=Desktop", "title": "5 budget-friendly getaways near Saigon to escape Tet crowds", "content": "Within 300 kilometers of Ho Chi Minh City, these five getaways present an opportunity to escape the Tet crowds, offering a retreat to the beach, camping, or mountain trekking. From Ho Chi Minh City, numerous natural attractions await, from national parks and streams to waterfalls. Nguyen Quang, owner of a campsite, notes that the cost of these trips is just under VND3 million ($122) per person, spanning a three-day schedule, offering relaxation from the hustle and bustle of the city. Here are 5 budget-friendly destinations that Quang recommended for nature travelers looking to steer clear of the crowds at the start of the year. 1. Bu Gia Map National Park in Binh Phuoc Province Bu Gia Map National Park, spanning over 25,000 hectares in Phu Nghia Commune, Bu Gia Map District, Binh Phuoc Province is just 190 kilometers and a 4-5 hour drive from Ho Chi Minh City. During this time of the year, with an average temperature of 26 degrees Celsius, the park offers an ideal setting for outdoor activities. The national park showcases a variety of tree species characteristic of transitional forests from the Central Highlands to the southeast region. Visitors can explore the rescue center dedicated to the conservation and development of creatures, gaining insights into the ecological behavior and characteristics of primates and various animal species within the national park. Additionally, camping beside Dak Ca Stream and Dak Manh Lake provides opportunities for fishing, cooling off, and savoring dishes such as wild vegetables and roasted duck with mac mat (clausena indica) leaves. The cost of a national park trekking tour is approximately VND2.5 million ($102). 2. Dinh Mountain in Ba Ria - Vung Tau Province Dinh Mountain is an escape just 70 kilometers from Ho Chi Minh City. The journey to the top, surrounded by greenery, leads to Tien and Da streams with five lakes suitable for bathing. The top of Dinh Mountain features pagodas like Hang Pagoda, Dai Tong Lam Pagoda, and Tay Phuong Pagoda, providing panoramic views of Long Son peninsula and part of Vung Tau beach city. Caution is advised on the ascent due to multiple paths without clear signs. Hiring a local guide or exercising care is recommended. 3. Cu Lao Cau Islet in Binh Thuan Province Also known as Hon Cau, Cu Lao Cau is an islet in Tuy Phong District in Binh Thuan Province, approximately 110 kilometers from Phan Thiet City and 240 kilometers from Ho Chi Minh City. Accessible by boat or canoe in 40 to 50 minutes, the island offers calm seas and cool weather from the first to fifth month of the lunar calendar. Visitors can opt for a day trip or overnight stay, bringing their own supplies as the island is uninhabited. A one-day tour, inclusive of round-trip boat service, seafood lunch, diving equipment for coral viewing, and a local guide, costs VND650,000 ($26) per person. Highlights include Tien Beach, Tien Well, Ba Hon Cave, Love Cave, Ca Suot Beach, and Nam Hai Temple. 4. Phi Lieng Waterfall in Lam Dong Province Situated in Phi Lieng Commune, Dam Rong District, Lam Dong Province, Phi Lieng Waterfall is a destination 70 kilometers southwest of Da Lat city center and less than 290 kilometers from Ho Chi Minh City. Phi Lieng is a waterfall that cascades through seven levels, with the main level towering over 100 meters in height. To reach the base of the waterfall, visitors need to traverse a dirt road, which can be challenging during the rainy season. However, at the beginning of the year, which is the dry season, traveling to the site becomes easier. Beginner trekkers are encouraged to select guided tours, which are available at prices starting from VND2 million ($81) per person. 5. Bidoup - Ta Giang trek Spanning over 30 kilometers through Lam Dong, Ninh Thuan, and Khanh Hoa provinces, the Bidoup - Ta Giang trekking route starts at Hon Giao Mountain in Bidoup - Nui Ba National Park, Lam Dong Province, approximately 350 kilometers from Ho Chi Minh City. Before starting the trek, visitors need to check in with the park management. A ranger will guide the group through slopes, forests, and grassy hills. The trek concludes at Ta Giang stream in Thanh Son Commune, Khanh Son District, Khanh Hoa. This trek is not suitable for beginners, and approval from the park management board is needed for trekking and camping in Phuoc Binh National Park. Once approved, a ranger will accompany and guide travelers to the end of the national park. The terrain in Bidoup - Nui Ba National Park is mostly gentle slopes. As you pass through Bidoup forest, the altitude gradually decreases toward the Phuoc Binh area. Here, visitors will encounter a different terrain with grassy hills almost half their body height. When trekking, visitors should bring their own food, drinks, and cooking utensils. The best time for the Bidoup - Ta Giang trek is from January to September, with an ideal period starting from March as it marks the end of the windy season.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/how-to-prepare-crunchy-pork-ear-roll-4704960.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-57&vn_term=Desktop", "title": "How to prepare crunchy pork ear roll", "content": "Gio xao, a staple of northern Tet celebrations, combines simple ingredients to create a dish with diverse textures – from the crunchiness of pork ear to the richness of pork cheek. This dish has two names: gio xao (stir-fried pork roll) based on the preparation method and gio thu (pork head roll) based on the ingredients, primarily pork head meat like ears and cheeks. This recipe serves about 6 to 8 people, takes approximately 75 minutes to prepare, and provides around 3,000 calories in total. Ingredients - 1 pork ear (400 grams) - 500 grams pork cheek - 1/2 pork trotter (400 grams) - 30 grams of dried wood ear mushrooms - 2 shallots - Banana leaf or a stir-fried pork roll mold - Bamboo strings - Spices: fish sauce, MSG, crushed pepper, shallots Instruction 1. Preparation - Begin by thoroughly shaving the pork ear, pork cheek, and pork trotter. - Rub the cleaned pork ear, cheek and trotter with lime and salt, ensuring that any undesirable odors are minimized. - Rinse the meat thoroughly under running water. - Blanch the pork ear, cheek, and trotter with crushed shallot and salt. This process helps remove impurities and enhances the fragrance of the meat. - Thoroughly wash and drain the meat, then slice it thinly. - Combine all the sliced meat and marinate with 1.5 to 2 tablespoons of fish sauce, 3 teaspoons of crushed pepper, and 1 teaspoon of MSG. - Allow the meat to marinate for at least 30 minutes to infuse the flavors. - Soak wood ear mushrooms, wash, and cut into 0.5 cm thick pieces. 2. Cooking process - Heat a pan over medium heat and add shallots to it. - Then add the pork ear, cheek, and trotter to the pan with the shallots. - Stir-fry the meat for about 5 minutes over low heat to prevent sticking. - Once the meat firms up, increase the heat. - Stir well to drain any excess moisture or liquids from the ingredients. - Add the sliced wood ear mushrooms into the stir-fried mixture. - Stir the mixture for a few minutes, and adjust the seasoning to taste. - Continue stir-frying the pork mixture until the skin softens and begins to stick. - Allow the stir-fried meat to cool slightly before wrapping. This helps to release any excess heat, as meat that's too hot may spoil rapidly. On the other hand, if it becomes too cool, the mixture won't be sticky enough, which can make it difficult to shape into a firm roll. - Heat banana leaves over fire to enhance their flexibility and fragrance, then wash the banana leaves thoroughly. - Place a few layers of the prepared banana leaves on a flat surface. - Spoon the stir-fried meat onto the layered banana leaves. - Roll the banana leaves tightly around the meat, then secure the roll by tying them with bamboo strings. - After wrapping, press the roll with a heavy object to remove excess fat and ensure a compact shape. - During cold weather, the roll can be used after half a day of wrapping. - Alternatively, you can put the roll in the refrigerator to make it firm more quickly. - If available, you can opt for a pork roll mold, especially when making a large batch with limited banana leaves. - You can line the inside of the mold with heated banana leaves to impart the aroma to the stir-fried roll. - Transfer the stir-fried meat into the mold. Apply pressure using the handle to compact the mixture into the cylindrical shape. 3. Finished product - The stir-fried pork roll presents a well-defined shape, ensuring that each slice holds together in a clean cut - When eaten, one can savor the crunchy texture from the ear, the fattiness from the cheek, the fish sauce aroma, the spiciness from the pepper, and the subtle fragrance of banana leaves.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/chinese-tourists-biggest-spenders-in-singapore-report-4707710.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-66&vn_term=Desktop", "title": "Chinese tourists biggest spenders in Singapore: report", "content": "Chinese tourists spent a total S$2.3 billion (US$1.7 billion) while traveling in Singapore last year, making them the biggest spender in the city state. Indonesia came in second with tourist spending at S$2.2 billion, followed by Australia (S$1.5 billion), The Strait Times reported citing a report from the Singapore Tourism Board. The report also revealed the island city state's tourism receipts last year reached around an estimated S$25 billion, surpassing an earlier forecast of S$21 billion. The average length of stay also rose to 3.8 days in 2023, higher than 3.4 in 2019. Last year, Singapore received 13.6 million foreign arrivals. The top source markets were Indonesia (2.3 million), China (1.4 million) and Malaysia (1.1 million). Singapore and China have agreed to a 30-day mutual visa-free entry for their citizens, which will formally come into force on Feb. 9 - the eve of the Lunar New Year.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/buddhists-tourists-pay-homage-to-maitreya-bodhisattva-statue-on-ba-den-mountain-4709086.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-50&vn_term=Desktop", "title": "Buddhists, tourists pay homage to Maitreya Bodhisattva statue on Ba Den Mountain", "content": "Over 500 monks, nuns, Buddhists, and pilgrims attended the Consecration Ceremony of the Maitreya Bodhisattva statue, crafted from the world's largest banded agate, at Ba Den Mountain. Under the leadership of the Vietnam Buddhist Sangha (VBS) of Tay Ninh Province, the Consecration Ceremony of the Maitreya Bodhisattva statue on the top of Ba Den Mountain was held with great solemnity Jan. 28, including sacred rituals such as chanting prayers, purification ceremonies, and recitation of blessings. Located at an altitude of 900m on the peak of Ba Den Mountain, the giant Maitreya Bodhisattva Statue stands 36 meters tall, with a maximum width of 45 meters and a surface area of 4,651 square meters. This sculpture, weighing 5,112 tons, is a unique creation in Vietnam, composed of 6,688 natural sapphire stones assembled to resemble terraced fields. Each sapphire stone was carefully selected for color, veining, and precise dimensions before being sculpted according to the design template. The emotional speech at the ceremony by Venerable Elder Vien Minh, Deputy Dharma Master of the Vietnam Buddhist Sangha, said that the Maitreya Bodhisattva Statue symbolizes the virtues of compassion and generosity and is the future Buddha, representing the prosperity and peace of our country's future. \"I am delighted and commend the merit of Sun Group, its leaders, and all employees who have wholeheartedly built a beautiful tourist area, enriching the spiritual life, promoting the beauty of Vietnam, and contributing to the prosperity of the Vietnamese economy,\" he said. The most touching moment of the ceremony was when over 20,000 lanterns, inscribed with prayers by Buddhist followers, locals, and tourists, were lit, creating a magical and sacred space. Each lit candle carries the wishes of tranquility and prosperity from Buddhist followers, tourists, and locals. The entire square space under the foot of the Tay Bo Da Son Buddha at Ba Den Mountain was illuminated during the lantern offering ceremony, creating a grand lantern festival. \"Although I have been to Ba Den Mountain twice, this is the first time I have participated in such a large-scale lantern offering ceremony. Especially since this is the first time, I have seen the Maitreya Bodhisattva Statue, made of the largest jade stone in the world, I feel even more touched and fortunate. Being able to come to pay homage to the compassionate Western Bodhisattva, I also feel serene, compassionate, and forget about everyday worries, feeling happier,\" said Ngo Bich Lien from Can Tho. The addition of the Wishing Bridge, a 90-meter-long crescent-shaped bridge, provides a symbolic and visually stunning experience for pilgrims and tourists. The Wishing Bridge, adorned with golden metallic tiles depicting cloud patterns, symbolizes prosperity and tranquility, enhancing the spiritual journey to the Maitreya Bodhisattva Statue. Serving as a bridge to the statue and offering panoramic views of the vast plains and Dau Tieng Lake, the Wishing Bridge enriches the overall experience of the pilgrimage. Nestled behind and surrounding the Maitreya Bodhisattva Statue is a colossal, 35-meter-high artificial waterfall, creating a dazzling and enchanting scene atop Ba Den Mountain. The world-renowned Maitreya Bodhisattva Statue, crafted from top-quality granite, stands at the center, while the waterfall is complemented by a modern fountain system, a first-of-its-kind technology in Vietnam, and an array of impressive lights and culturally rich dance performances by actors. Together, they form a grand and artistically rich water music show, reflecting the spiritual and cultural essence of the region. The Consecration Ceremony of the Maitreya Bodhisattva Statue, along with the appearance of the Wishing Bridge and the grand and impressive water music show, have contributed to the completion of the spiritual and cultural complex on top of Ba Den Mountain. At the ceremony, Vo Duc Trong, Permanent Vice Chairman of the People's Committee of Tay Ninh Province, said that with the contribution of Sun Group, Ba Den National Tourist Area has been thoroughly invested with many internationally renowned works such as the highest statue of Tay Bo Da Son Buddha on the mountain peak, the largest cable car station in the world, and a Buddhist exhibition center applying the world's leading advanced technologies. \"Today, with the Maitreya Bodhisattva Statue made of the world's top large sapphire stone, created in a special method never seen before in Vietnam, Sun Group has created a new symbol of a new stature for Tay Ninh tourism,\" he said. On this occasion, the exhibition \"Great Peace, Great Prosperity\" is being held until March 2024, showcasing over 50 ancient statues, six precious artifacts, and three paintings revolving around the story of Di Lac Bo Dai Hoa Thuong (Maitreya), and the set of statues symbolizing the desires for happiness, prosperity, and peace.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/thailand-records-2-74-million-foreign-tourist-arrivals-in-january-4707085.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-73&vn_term=Desktop", "title": "Thailand records 2.74 million foreign tourist arrivals in January", "content": "Thailand received 2.74 million foreign visitors from Jan. 1 to 28, up 40% year-on-year, the tourism ministry said on Tuesday. During this period, China was Thailand's top source of tourists. The government is targeting 35 million foreign tourists in 2024, up from an estimated 28 million visitors last year. The two countries have mutually waived visas with effect from March. Vietnam received 1.51 million foreign tourists in January, up 10.3% from the previous month and 73.6% year-on-year and the highest monthly number since it reopened post-Covid.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/malaysia-eyes-to-attract-over-5-million-chinese-tourists-in-2024-4708230.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-59&vn_term=Desktop", "title": "Malaysia eyes to attract over 5 million Chinese tourists in 2024", "content": "Malaysia is actively developing a strategy to attract more than 5 million tourists from China this year. Ammar Abd Ghapar, director-general of the Malaysian Tourism Promotion Board (Tourism Malaysia), said the strategy includes increasing flight frequencies from China and encouraging new airlines in the country to consider promoting Malaysia as a top destination of choice. Speaking after welcoming Loong Air's inaugural flight from China's Hangzhou at Kuala Lumpur International Airport (KLIA) on Feb. 2, the official said that Malaysia is encouraging more charter flights from China to implement the initiative and leveraging with travel agents and airlines to increase the frequency of flights from maybe twice a week to the target of four flights a week. He said the target is also in line with the 50th anniversary of the establishment of diplomatic relations between Malaysia and China this year, in addition to boosting tourism efforts for Visit Malaysia Year 2026. He was also optimistic that Tourism Malaysia can reach the target of between 5 million and 7 million Chinese tourists for this year, which means a five-fold increase on last year’s Chinese arrivals, in line with the 30-day visa exemption initiative for Chinese and Indian tourists which started on Dec. 1, 2023. Earlier, Tourism Malaysia Deputy Chairman Datuk Yeoh Soon Hin said China is a key tourist source market to Malaysia and remains in the top six markets for tourist arrivals into Malaysia. In 2023, Malaysia received about 1.4 million Chinese tourists and in total about 18 million international tourist arrivals with US$14.02 billion in tourism expenditure. Yeoh Soon Hin said that the new route from Hangzhou, new routes and package flights connecting first- and second-tier cities in China with Malaysia are expected to be able to meet the growing demand of tourists from China. Loong Air plans to operate three flights per week on Tuesdays, Thursdays, and Saturdays from Hangzhou Xiaoshan International Airport to KLIA and round trip in the opposite direction.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/nearly-300-taiwanese-tourists-stranded-in-phu-quoc-fly-home-4711497.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-11&vn_term=Desktop", "title": "Nearly 300 Taiwanese tourists stranded in Phu Quoc fly home", "content": "292 Taiwanese tourists who were stuck on Vietnam’s largest island Phu Quoc after their tour company defaulted on a payment flew home on Wednesday afternoon. They arrived at Phu Quoc International Airport to board their charter flight back to Taiwan at 12:30 p.m., said Ha Tuan Minh, director of local travel agency Winner Vietnam, which was to provide them with services. On her personal page, Huang Chengxi, one of the Taiwanese tourists \"abandoned\" in Phu Quoc, thanked Minh’s company for her support. \"We are now safe and continue our journey,\" she wrote. The visitors had booked a four-day tour to the island through We Love Tour company in Taipei and flew in by charter flight on Feb. 10, Lunar New Year’s Day. Initially, the Taiwanese partner had agreed to make full payment by Jan. 31 but failed to pay and Minh’s company canceled the contract. But the Taiwanese company went ahead and sent the group to Phu Quoc, where there were no vehicles and hotels or waiting for them. It contacted Minh and pleaded with him to take care of the visitors. He then sent 18 buses and Chinese-speaking guides to Phu Quoc airport and lodged the visitors at two five-star hotels. The Taiwanese company had promised to pay on Feb. 11, but again failed to pay. Bui Quoc Thai, head of the Kien Giang Tourism Department, announced on Wednesday that his department, in collaboration with officials in Phu Quoc city, reviewed the contract between We Love Tour company from Taiwan and Vietnam's Winner company to provide clear information to the tourists. He criticized the Taiwanese travel agency's irresponsible act of leaving almost 300 tourists stranded and stated that any violations by Vietnamese companies would be penalized. Taipei Economic and Cultural Office in HCMC got in touch with both sides, telling the Taiwanese company to make full payment by Feb. 26 while Minh’s company continues hosting the tourists. According to a source from Bamboo Airways, even though it had not received payment from the Taiwanese tour company, the airline still carried the tourists to return home on schedule. The incident took place on the first days of the Lunar New Year and attracted the attention of international media. On social media forum Today.line.me, many Taiwanese people criticized the We Love Tour for abandoning customers and fraud, calling on their authorities to strictly handle the company.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/tourists-caught-wearing-swimsuit-at-phuket-airport-4708084.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-58&vn_term=Desktop", "title": "Tourists caught wearing swimsuit at Phuket airport", "content": "A photo of two foreign men wearing only swimming trunks at Phuket International Airport has gone viral on social media, sparking public uproar from Thai netizens. In a post shared in Facebook group on Jan. 30, the men were caught sorting their suitcases at the luggage trolley stand with only their swimsuits and many netizens criticized their act as \"disrespectful to Thai culture.\" \"How do they have no shame?\" a netizen wrote. Some other netizens said they felt like \"vomiting\" due to the men's inappropriate behavior. A representative of Phuket airport said the two foreign tourists were dropped from a car in front of the international terminal. They put on clothes before entering the terminal properly, however, Phuket News reported. Phuket is an island in Thailand known for its beaches, with Phuket International Airport located approximately three kilometers from the nearest beach. This was not the first time foreign tourists had suffered criticism from Thai netizens for their disrespectful acts. Earlier, photos of two foreign women sunbathing in bikinis in front of Bangkok's Grand Palace used to host royal traditional ceremonies also triggered a public outcry. In another case, two Polish female tourists expressed their regret and apologized to Thai residents for sunbathing on grass at a Chiang Mai Temple.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/japanese-man-visits-vietnam-30-times-for-the-food-4707155.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-36&vn_term=Desktop", "title": "Japanese man visits Vietnam 30 times for the food", "content": "Inoue Keiichi has been to Vietnam 30 times in five years because every time he leaves he \"misses\" the country's beautiful and diverse cuisine. His love for Vietnam began in March 2018 when the 25-year-old Japanese man traveled abroad for the first time. On his first day in Ho Chi Minh City, Keiichi was \"captivated\" by the banh mi. Sweet and sour chili sauce, grilled meat sandwiches, and pate spread served with pickles made it possible for him to eat three loaves a day without getting bored. \"In the following days, I tried more types of Hoi An bread, milk bread, and pillow bread. Every type was delicious despite the different sweet and salty flavors,\" he said. Because there was not much time on that trip, Keiichi regretted that he did not have the chance to try enough other dishes. However, when he boarded the plane to return home, the young man still tried to carry a few more loaves of bread. Returning home, he looked for places that sold Vietnamese bread and he had tried more than 20 stores but he did not find the true Vietnamese flavor. Three months later, he bought a ticket back to Vietnam. This time he decided to travel alone from the south to north for a month to fulfill his wish of \"eating authentic Vietnamese food,\" focusing on typical dishes from each region such as noodle soup, mixed rice paper, crab soup or pho, snail vermicelli and draft beer. \"Some days I ate 6-7 meals. I enjoyed banh cuon (steamed rice rolls) and drank more than six cans of Hanoi beer. I still didn't get bored eating three or four cups of sweet soup che at once,\" he said. Keiichi said pungent dishes like bun dau mam tom (vermicelli with tofu and fermented shrimp paste) and durian made him almost vomit the first time he ate them, but now he was addicted to them. \"Now I always eat one durian every month. I can't stand it if I don't eat it,\" he said. \"I really missed Vietnam every time I had to leave this place. Sometimes when I return to Japan for a few days, I only wanted to buy a ticket to return to Vietnam. I love the way Vietnamese people are close and support each other,\" Keiichi said. Keiichi said he just celebrated the New Year holiday in Vietnam instead of returning to his hometown to reunite with his family. The sight of people gathering in the city center to watch music events and fireworks together made him feel like the city was all one big, happy, warm family. \"I've been in Vietnam for four seasons: spring, summer, fall, and winter but have never celebrated traditional Tet. This year I will stay here to celebrate Tet,\" he said. The young man admitted that he was a little worried when he heard that during the Lunar New Year, people rest and close their shops to return to their hometowns to be with their families. However, he plans to join Tet activities such as wrapping banh chung (square sticky rice cake), eating meat and pickled onions, and watching traditional festivals, things that only take place during Tet. \"Maybe I will ask to celebrate Tet at the house of some close Vietnamese friends. I feel happy to see the bustling streets on the day leading up to Tet, with people queuing to buying peach blossoms and Tet decorations,\" Keiichi said.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/phu-quoc-to-have-first-on-beach-puppet-theater-in-vietnam-4711276.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-15&vn_term=Desktop", "title": "Phu Quoc to have first on beach puppet theater in Vietnam​", "content": "The Vietnamese puppet art program \"Tray Hoi Mua Xuan\" (Spring Celebration) will be held in Sunset Town, Phu Quoc, aiming to showcase Vietnam's intangible cultural heritage to both domestic and foreign tourists. \"Tray Hoi Mua Xuan\" is a free 30-minute show to be performed daily from 7:30 p.m. at Sunset Town Beach. After each show, visitors can experience puppetry, chat with elite artists, and learn more about this type of stage performance art. The program is invested in by Sun Group, directly produced by People's Artist Nguyen Tien Dung, Director of Vietnam Puppet Theater, and performed by Vietnam Puppet Theater, one of the largest and leading puppetry art centers in Vietnam. The eight-part performance tells the story of the productive working life and beliefs of Vietnamese people, bringing viewers into the flow of Vietnamese culture, discovering the beauty of spring festival, the working life of rice farming, as well as spiritual culture and Vietnamese beliefs. There is also the appearance of a quai thao hat metaphorically resembling moonlight or a boat on water. The puppet show in Phu Quoc is an intersection between tradition and contemporary art, creating a new but still close and familiar experience for the audience. Nguyen Tien Dung said the festival combines many different types of art and performances, such as land puppetry, water puppetry, and dance art. As for the music, the audience will also listen to cheo singing and chau van singing. A special highlight lies in the final performance, \"Hello Vietnam,\" with new harmonies using the flute, and gourd and drums. These traditional musical instruments will be combined with the ao dai dance and conical hats. One of the things that makes \"Tray Hoi Mua Xuan\" unique is the water pavilion that simulates Thay Pagoda. This is the most ancient pagoda in Hanoi and the founding stage of Vietnamese water puppetry. The architectural and artistic relics of the Ly Dynasty promise to be a highlight in the poetic picture Hoang Hon Town. Before Phu Quoc, artists at the Vietnam Water Puppet Theater brought this Vietnamese intangible cultural heritage to 70 countries and territories around the world. People’s Artist Dung said that from the first conversations, they felt in harmony with Sun Group. Both sides desired to bring traditional culture into tourism. He and the artists at the theater were happy to perform in Sunset Town, which gathers many other art forms with many international tourists. \"We can introduce the age-old theater art to tourists so that all nationalities and ages can learn more about the country and people of Vietnam. In particular, we Vietnamese people also understand more about the value of traditional cultural arts and are proud of our international friends,\" Dung said. The puppet performances, along with other unique art shows at the multi-million-dollar entertainment complex in Sunset Town, help visitors increase their experience, contributing to honoring and bringing back traditional values and bringing Vietnamese culture closer to the world.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/a-weekend-of-art-exhibitions-and-jazz-in-hanoi-4691837.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-68&vn_term=Desktop", "title": "A weekend of art exhibitions and jazz in Hanoi", "content": "This weekend in Hanoi offers a diverse range of cultural experiences, from art exhibitions to jazz tributes, shared dining experiences and historical commemorations. Art exhibition \"Becoming Alice: Through the Metal Tunnel\" \"Becoming Alice: Through the Metal Tunnel\" is an art exhibition presenting artworks inspired by the world created by English author Lewis Carroll in his literary work, \"Alice's Adventures in Wonderland.\" The artworks symbolize the transition from youth to adulthood and challenge linear thinking. The exhibition is open from 9 a.m. to 7 p.m., from Jan. 30 to March 3, at The Outpost Art Organization, located at Roman Plaza Tower B1 (Floor 2), To Huu Street, Nam Tu Liem District. Ticket prices vary: VND60,000 ($2.40) for standard admission, VND40,000 ($1.60) for students, and free for individuals over 65 and children under 6. Jazz tribute to Wayne Shorter's \"The All Seeing Eye\" The event is a jazz tribute dedicated to Wayne Shorter's 1965 album, \"The All Seeing Eye.\" This showcase emphasizes Shorter's avant-garde saxophone performance, challenging traditional jazz norms through complex structures and harmonies. The event starts at 8:30 p.m. on Feb. 2 and 3, at Long Waits, located at 5 Nguyen Quang Bich Street, Hoan Kiem District. Registration is required via the provided link, incurring a surcharge of VND250,000 ($10) per person. Karma kitchen Karma Kitchen, an event where meals are served without price tags, operates entirely through voluntary contributions, from the cook to the receptionist, waiter, and parking attendant. The menu features drinks and vegan food. The purpose of Karma Kitchen is to provide a dining experience based on generosity and trust. The goal is to foster a sense of community and shared commitment and promote a more supportive society. The event is scheduled for Feb. 4, from 11 a.m. to 2 p.m. at VEJO - The Vege Journey, located at 46B Bat Dan Street, Hang Bo Ward, Hoan Kiem District. To secure a place, reservations can be made via the Karma Kitchen Hanoi Facebook page. Historical exhibition \"Two Spring Scenes\" The Management Board of Hoa Lo Prison is organizing an exhibition titled \"Two Spring Scenes\". The exhibition presents documents and images depicting spring activities for prisoners during Tet at Hoa Lo Prison. Additionally, the exhibition also recreates historical images of spring celebrations in both the north and south. The exhibition takes place at Hoa Lo Prison, situated at 1 Hoa Lo Street, Hoan Kiem District, until the end of March. Entrance fee is VND50,000 ($2) per person.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/chinese-tourist-lies-about-being-robbed-by-thai-motorcycle-taxi-driver-4711734.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-5&vn_term=Desktop", "title": "Chinese tourist lies about being robbed by Thai motorcycle taxi driver", "content": "A Chinese tourist was charged with reporting false information after he was found lying about 20,000 baht (US$550) being snatched by a motorcycle taxi driver in front of a hotel in Phuket. Late last week, Xing Jingwei, 38, filed a report to local police, claiming he was robbed by a motorcycle taxi driver in front of a hotel on the Phra Metta Road, Thaiger news site reported. Officers then managed to track down and arrest the driver who pleaded innocence. He said they only engaged in a fare dispute before he left the scene. He explained that he picked up the Chinese man in the Ban Mon area and dropped him off in front of the hotel. The tourist complained about the expensive fare, and both had a quarrel due to the language barrier, the Phuket News reported. Police questioned the Chinese tourist again until he confessed that he faked the complaint. The tourist didn’t explain why he had done so. Under the Thai law, he could face up to six months in prison or a hefty fine for reporting false information. The incident has sparked a wave of criticism among Thai netizens over the past day. \"Free visa, only focus on quantity not quality,\" a netizen wrote. \"Anything is possible in Phuket,\" another wrote. Thailand expects to welcome at least 8 million Chinese tourists this year, double last year's figure, after both countries agreed to waive visas for each other's citizens beginning in March.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/places/northern-vietnam-getaways-to-explore-during-lunar-new-year-4704832.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-75&vn_term=Desktop", "title": "Northern Vietnam getaways to explore during Lunar New Year", "content": "Explore northern Vietnam's varied attractions during the Lunar New Year with this guide, featuring adventure, leisure, and spiritual experiences. The suggested trips are tailored for tourists departing from Hanoi, spanning three or four days, making it suitable for families venturing out after the first day of Tet. The suggestions are based on the advice from travel companies in Hanoi. These trips are also well-suited for travel by car. Adventure tourism 1. Witness plum blossoms in Moc Chau District, Son La and other mountainous provinces The journey from Hanoi to Moc Chau covers 180 kilometers, taking approximately 4-5 hours depending on traffic conditions. The beginning of the year is the best time in Moc Chau when plum blossoms begin to bloom. Plum and apricot blossoms typically last about two or three weeks, providing visitors with enough time to select the most suitable departure time. Some must-visit places in Moc Chau include Na Ka plum valley, heart-shaped green tea hill, Ban Ang pine forest, and the 632-meter-long Bach Long (White Dragon) glass bridge that is recognized by Guinness as the world's longest. The cuisine on offer includes salmon and sturgeon dishes, rau cai meo (brassica oleracea), calf cooked with fermented bean curd, Chinese snails, and dairy dishes. In addition to Moc Chau, numerous destinations in the northern highlands also captivate tourists during Tet, such as the provinces of Yen Bai, Cao Bang, Bac Kan, Son La, and Dien Bien. 2. Climbing and cloud hunting Winter and spring are often the best times to hunt clouds in: - Ta Xua Peak in Son La Province - Lao Than Peak, Bach Mong Luong Tu Peak, and Ngu Chi Son Peak in Lao Cai Province - Sin Ho Town in Lai Chau Province - Ta Chi Nhu Peak in Yen Bai Province To ensure safety, visitors should opt for a guided tour. Typically lasting two days and one night, these tours often include visits to local places, which can extend the duration based on preferences. During these trips, visitors can witness primeval forests, diverse terrains, streams, and waterfalls, all with a moderate level of difficulty. Typically, the group sleeps at a meeting point which is about 30-40 minutes' walk from the peak to commence cloud hunting early the next morning. The tour prices range from VND3 million to VND5 million ($120 to $200). 3. Cave tours in Quang Binh Province Quang Binh is about 488 kilometers from Hanoi. The province is renowned for its caves, offering two-to-three-day tours (excluding travel time) during the Lunar New Year. Notable options include Va Cave trip from tour operator Oxalis Adventure or Hung Thoong Cave and Tiger Cave from tour operator Jungle Boss. These tours are typically all-inclusive, excluding travel costs from the starting point. Safety equipment and meals will be provided to guests throughout the journey. Participants need to maintain good health and a clear mental state. Prices range from VND8,000,000 to VND12,500,000 ($325 to $508) per person. Leisure tourism 1. Yacht tour Cruising on Ha Long Bay in Quang Ninh Province or the nearby Lan Ha Bay of Hai Phong City is an ideal experience for those seeking rest and relaxation. These tours usually offer a choice of two days and one night, or three days and two nights. Tourists have the option to spend two nights on the boat, touring pre-set stops on the schedule, or to stay one night on the boat and one night onshore in Ha Long City or Cat Ba Island District. They can participate in activities like yoga, tai chi, kayaking, and easy bike rides to see destinations such as Viet Hai fishing village, Ba Trai Dao Beach in Lan Ha Bay, Ti Top Island, and Sung Sot Cave in Ha Long Bay. Recommended operators include Heritage Cruises Binh Chuan, Mon Cheri, Scarlet Pearl, Stellar of the Seas, Paradise, Ambassador, and Indochine. The cost varies depending on the tour, ranging from VND3 million to VND8 million ($121 to 325) per person. 2. Hot mineral bath tour In the north and north central regions, numerous places feature hot springs, such as: - Thanh Thuy hot spring in Phu Tho Province - Kim Boi hot spring in Hoa Binh Province - My Lam hot spring in Tuyen Quang Province - Tram Tau hot spring in Yen Bai Province - Ke Ga hot spring in Ninh Binh Province - Quang Hanh Onsen in Quang Ninh Province However, not all locations have modern resorts with high-quality services. For those seeking premium accommodations with hot mineral baths, consider these recommended destinations: - Serena Resort in Hoa Binh Province - Ohayo Onsen in Thanh Thuy District, Phu Tho Province - Yoko Onsen Quang Hanh in Quang Ninh Province - Bang Onsen in Quang Binh Province. Beyond indulging in hot mineral baths, visitors can also explore the tourist attractions in each locale throughout the remainder of their stay. 3. Resorts in popular attractions Tet marks the peak of the tourist season, with many popular destinations becoming crowded. By choosing to stay in resorts and hotels, you will find yourself comfortably accommodated. Many of these destinations feature amenities like heated swimming pools, health care massage services, fully equipped gyms, and yoga classes. For a getaway spanning three to four days, travelers can explore resorts in the north and north central regions, including: - Flamingo Dai Lai Resort in Vinh Phuc Province - Vinpearl Ha Long in Quang Ninh Province - Sun Spa Resort in Quang Binh Province - Muong Thanh Luxury in Nghe An Province - Jade Hill Resort & Spa - Silk Path Grand Resort & Spa - Hotel de la Coupole - MGallery in Sa Pa Town, Lao Cai Province - FLC Luxury Hotel Sam Son in Thanh Hoa Province - Melia Vinpearl Cua Sot Beach Resort in Ha Tinh Province Spiritual tourism These tours are usually short, spanning one to two days with an overnight stay, and often include trips to nearby attractions. From Hanoi, common choices are: - Tam Chuc Pagoda, Phat Quang Pagoda, and Ksitigarbha Phi Lai Pagoda in Ha Nam Province. - The Van Long Nature Reserve, Hoa Lu Ancient Capital, Bai Dinh Pagoda, and Tam Chuc Pagoda in Ninh Binh and Ha Nam provinces. - The Yen Tu pagoda complex in Quang Ninh Province.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/food-recipes/a-tradition-of-feasting-10-vietnamese-tet-meals-4710174.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-27&vn_term=Desktop", "title": "A tradition of feasting: 10 Vietnamese Tet meals", "content": "At Tet, a diverse array of dishes – from sticky rice cakes and spring rolls to boiled chicken – graces family food trays everywhere, symbolizing prosperity, luck, and familial unity. As the Lunar New Year approaches, Vietnamese households bustle with excitement and anticipation, preparing for one of the most significant and cherished celebrations of the year. Join us on a culinary journey as we explore the 10 common dishes that adorn the Lunar New Year food tray in Vietnam. 1. Banh chung/banh tet (sticky rice cakes) Banh chung, a square rice cake, is commonly enjoyed savory in northern Vietnam, while banh tet, a cylindrical sticky rice cake and a specialty of central and southern region, can be found in both savory and sweet variations. The main ingredients of both these cakes often include glutinous rice, mung beans, pork belly, and a blend of spices such as salt, pepper, green onions, and fish sauce. These ingredients are layered, wrapped in banana leaves, and boiled or steamed until cooked through. Legend has it that banh chung was created by a Vietnamese prince, Lang Lieu, as a symbol of respect for ancestors, representing the Earth through its ingredients sourced directly from the land. The origins of banh tet are believed to trace back to the Cham people, with the cake likely evolving through a combination of exchanging culinary practices and sharing cultural traditions between the two communities. Another account of banh tet's origin tells of a moment during King Quang Trung's rule in 1789. In the midst of a battle against invaders, a soldier offered the king a cake as a symbol of goodwill. Moved by the gesture, King Quang Trung declared that the cake should be enjoyed during Tet, hence naming it Tet cake, or banh tet. Banh chung and banh tet typically feature soft and slightly sticky glutinous rice complemented by a subtle herbal aroma infused by the banana leaves. The mung beans and pork contribute to a savory flavor profile, characterized by a combination of fatty and nutty notes. 2. Boiled chicken Boiled chicken, a dish originating from Chinese cuisine, holds a significant place in Lunar New Year celebrations across Vietnam. In Vietnamese culture, roosters are traditionally favored over hens in New Year offerings. The rooster symbolizes new beginnings and the start of favorable conditions for agriculture. During Lunar New Year's Eve worship, offerings of sticky rice and boiled chicken are made, symbolizing hopes for prosperity and success in the upcoming year. The chicken is boiled until shiny and golden, infused with aromatic flavors of ginger. Accompanied by a salt and lime dip, it's served alongside sticky rice. In Hanoi, leftover Tet ingredients, like boiled chicken, are often repurposed to prepare delicacies such as bun thang (shredded chicken noodle soup). 3. Gio lua/gio xao (Pork roll/ pork ear roll) Pork roll, known as cha lua in the central and southern regions and gio lua in the north, is a pork delicacy commonly found in the food tray during Lunar New Year. Meanwhile, pork ear roll is a dish often enjoyed during Tet celebrations in northern Vietnam. Pork roll is prepared by pounding the meat into a thick paste and seasoning it with various spices, starchy flour, and fish sauce. Afterward, it’s wrapped in banana leaves and steamed. The result is a pork sausage characterized by a tender texture and a subtle pink hue, accompanied by a fragrance infused by the banana leaves. Known by two names gio xao (stir-fried pork roll) and gio thu (pork head roll), pork ear roll made from thinly sliced pork head meat, primarily ears and cheeks. Marinated with fish sauce and pepper, it's stir-fried with wood ear mushrooms until firm and golden. Wrapped in banana leaves and cooled to set, it offers a blend of textures and flavors - crunchy ear and cheek, fragrant fish sauce and spicy pepper, with a hint of subtle banana leaf aroma. In addition to its role in Tet celebrations, both pork roll and pork ear roll are enjoyed year-round as a complement to everyday dishes. 4. Xoi gac (red sticky rice) In Eastern culture, the color red represents happiness, luck, and goodness. During special occasions like Tet and ancestral ceremonies, people prepare a dish called red sticky rice. This dish is made by mixing sticky rice with gac fruit (sweet gourd). The rice is cooked until it's soft and fragrant. The result is red sticky rice, believed to symbolize prosperity and good fortune. Depending on where you are in Vietnam, some people like to add shredded coconut or coconut milk in the south, while others in the north might include green beans or sprinkle sugar on top. Despite its subtle sweetness, xoi gac is commonly paired with savory dishes such as pork floss and pork roll. 5. Spring rolls Spring rolls are known as cha gio in the south or nem ran in the north. Filled with a savory mixture of pork, shrimp, carrots, wood ear mushrooms, glass noodles, and bean sprouts, then wrapped in rice paper. The rolls are fried to perfection, resulting in a golden hue and a crispy exterior. The northern rendition of spring rolls typically features more vegetables encased in a thin rice paper skin, whereas the southern variation has a thicker outer layer with a heartier meat filling, often complemented by shredded taro. The origin of spring rolls is still a bit unclear, but there are a few ideas about where they came from. Many believe that they've been around in Vietnamese cooking for a long time. People up in northern Vietnam might have come up with them as an easy-to-eat dish that lasts a while, especially during wartime. Another prevalent theory suggests that spring rolls may have been influenced by similar dishes in Chinese cuisine. As part of cultural exchange, this dish likely made its way into Vietnamese culinary practices, where it was adapted to local tastes. The result is a dish that reflects the fusion of cultural influences in Vietnamese cuisine. These fried delights are often served alongside herbs and a sweet-sour fish sauce. Typically served as an appetizer, they can also be enjoyed with vermicelli or rice. 6. Braised pork with duck eggs Braised pork with duck eggs is a Tet dish widely enjoyed in southern and central regions. Prepared with pork belly, garlic, shallots, soy sauce, sugar, and fish sauce, braised pork is simmered in a blend of coconut water, garlic, and shallots. Slow-cooked alongside duck eggs until tender, it's commonly served alongside rice or pickled mustard greens. In a pot of braised pork with duck eggs, the juxtaposition of square meat pieces and round eggs symbolizes harmony and balance, reflecting the concept of yin and yang. The round eggs, representing fertility, symbolize wishes for a joyful New Year and a family blessed with abundance. 7. Stuffed bitter melon soup Canh kho qua, or stuffed bitter melon soup, is another dish enjoyed during Lunar New Year in southern regions of Vietnam. It's made by filling bitter melons with a mixture of ground pork, fish, mushrooms, and spices, then simmering them in broth until tender. The name kho qua, or bitter melon, explains the wish for all kho, sorrows and misfortunes of the old year, to qua - pass, to receive good news in the new year. This dish is not only symbolic but also offers numerous health benefits. Stuffed bitter melon is known for its cooling properties and high fiber. During Tet, the weather in southern Vietnam can be quite hot. Enjoying a bowl of stuffed bitter melon soup provides a refreshing respite from the heat, offering a cooling effect and balancing out the richness of other festive dishes. 8. Jellied pork Jellied pork is a popular dish in northern Vietnam, especially during the colder months and Lunar New Year celebrations. Made from pork leg and stir-fried pork skin with mushrooms, it's served cold and develops a jelly-like texture due to the collagen in the pig's skin. It is said that this dish started when stewed pork leg soup was left out in the cold and accidentally froze, turning into a special treat. Now, every Tet, families in the north make this dish to enjoy during the holiday. Jellied pork is perfect for eating cold, making it easy to store in cold weather or fridges without needing to heat it up again. It is often served with a side of spicy fish sauce to enhance its flavor. 9. Bamboo shoot soup If stuffed bitter melon soup reigns supreme during Tet feasts in the southern regions, then bamboo shoot soup serves as its counterpart in the north. The soup symbolizes warmth and togetherness during the festive season. In addition to its cultural importance, bamboo shoot soup is valued for its nutritional benefits, rich in vitamins and fiber. The soup is made with a variety of bamboo shoots including fresh bamboo and dried bamboo shoots. The dried bamboo shoots are soaked in water at least three times to reduce their strong odor. The soup is slow-cooked with pork knuckles to create a rich broth. 10. Dua hanh and cu kieu (pickled leeks and shallots) Pickle dishes like dua hanh (pickled shallots) and cu kieu (pickled leeks) are commonly found on festive menus. Pickled shallots are a favorite in northern regions, whereas pickled leeks are preferred in the south. Their mildly sour, slightly spicy, and aromatic flavors serve to offset the richness of dishes such as braised pork and sticky rice cakes. According to ancient beliefs, the inclusion of shallots and onions during Tet signifies wealth and prosperity.", "date": "2024-02-15 23:53:18"}, {"url": "https://e.vnexpress.net/news/travel/hcmc-pilots-use-of-electric-cars-to-serve-tourists-4707202.html?vn_source=Folder&vn_campaign=Stream&vn_medium=Item-72&vn_term=Desktop", "title": "HCMC pilots use of electric cars to serve tourists", "content": "Ho Chi Minh City is planning to use some 200 electric cars to transport tourists around downtown. The city's Department of Transport has submitted a pilot project of using electric cars to the municipal People's Committee for consideration and approval. Under the project, each car can carry 5-14 passengers, with a maximum speed of 30 km/h for tours around the city. The service will operate from six hours to 24 hours per day, and is carried out by the Saigon Public Transport Co., Ltd. The cars will park at a parking lot owned by the Sai Gon Transportation Mechanical Corporation (SAMCO) at No 121 on Co Giang Street in District 1. Pick-up and drop-off locations will be agreed upon with tourist accommodation establishments and tourist attractions. The area for vehicles serving tourism will be at September 23 Park in District 1. Tourists can book the electric car service via a mobile app or directly with staff. Initially, 70 cars with a capacity of eight to 10 seats will be put into operation. In the following stages, 60 more cars with seven seats or less and 70 cars with a capacity of 11-14 seats will be added to the fleet, which will operate 24 hours a day. The scheme will start from District 1 to District 4, crossing Nha Rong Wharf, Khanh Hoi Bridge, and Ton Duc Thang, Nguyen Binh Khiem, Nguyen Thi Minh Khai, Hoang Sa, Hai Ba Trung, Nguyen Van Cu and Vo Van Kiet Streets, Calmette Bridge, Doan Van Bo, Hoang Dieu and Nguyen Tat Thanh Streets, and Nha Rong Port. In the second phase, the service will be expanded to Districts 5 and 6, crossing Nguyen Van Cu, Nguyen Trai, Nguyen Tri Phuong, Hung Vuong, Hong Bang, Nguyen Thi Nho, Le Quang Sung, Pham Dinh Ho, Thap Muoi and Hai Thuong Lan Ong Streets. In the third phase, it will cover Thu Duc City and Districts 3 and 10.", "date": "2024-02-15 23:53:18"}]